{
    "(Blockchain Architect)": "(مهندس Blockchain)",
    "1. Acceptance of Terms": "1. قبول الشروط",
    "1. Introduction": "1. المقدمة",
    "10 min read": "10 دقائق قراءة",
    "10 weeks": "10 أسابيع",
    "10+ Downloads": "10+ تنزيل",
    "10. Dispute Resolution": "10. حل النزاعات",
    "11. Changes to Terms": "11. التغييرات على الشروط",
    "12 min read": "12 دقيقة قراءة",
    "12 weeks": "12 أسبوعاً",
    "12. Contact Information": "12. معلومات الاتصال",
    "127+ Challenges Completed": "127+ تحدي مكتمل",
    "127+ challenges completed with 85% success rate": "127+ تحدي مكتمل بنسبة نجاح 85%",
    "14 weeks": "14 أسبوعاً",
    "2. Description of Service": "2. وصف الخدمة",
    "24\/7 Support Available": "دعم متاح على مدار الساعة",
    "3. User Accounts": "3. حسابات المستخدمين",
    "3.1 Account Security": "3.1 أمان الحساب",
    "3.1 Account Types": "3.1 أنواع الحسابات",
    "3.2 Account Security": "3.2 أمان الحساب",
    "3.3 Account Termination": "3.3 إنهاء الحساب",
    "4 contributors": "4 مساهمين",
    "4. User Conduct": "4. سلوك المستخدم",
    "403 - Access Denied": "403 - الوصول مرفوض",
    "404 - Page Not Found": "404 - الصفحة غير موجودة",
    "450+ Contributors": "450+ مساهم",
    "5 min read": "5 دقائق قراءة",
    "5. Contributor Responsibilities": "5. مسؤوليات المساهم",
    "500 - Server Error": "500 - خطأ في الخادم",
    "5K Active Users": "5 آلاف مستخدم نشط",
    "6 min read": "6 دقائق قراءة",
    "6 weeks": "6 أسابيع",
    "6. Company Responsibilities": "6. مسؤوليات الشركة",
    "7 min read": "7 دقائق قراءة",
    "7 contributors": "7 مساهمين",
    "7. Intellectual Property": "7. الملكية الفكرية",
    "7.1 Platform Content": "7.1 محتوى المنصة",
    "7.2 User Content": "7.2 محتوى المستخدم",
    "7.3 Work Product": "7.3 منتج العمل",
    "8 min read": "8 دقائق قراءة",
    "8 weeks": "8 أسابيع",
    "8. AI Technology": "8. تقنية الذكاء الاصطناعي",
    "85% Success Rate": "نسبة نجاح 85%",
    "9. Limitation of Liability": "9. حدود المسؤولية",
    ":hours h estimated": ":hours س مقدرة",
    ":hours h logged": ":hours س مسجلة",
    ":hours h total": ":hours س الإجمالي",
    "A diverse team of 5 specialists developed a platform with Ethereum smart contracts for transparent lending, a mobile-friendly interface for borrowers, and comprehensive admin tools. The platform has facilitated over $2M in microloans.": "طور فريق متنوع من 5 متخصصين منصة بعقود Ethereum الذكية للإقراض الشفاف، وواجهة متوافقة مع الهاتف المحمول للمقترضين، وأدوات إدارية شاملة. سهلت المنصة أكثر من 2 مليون دولار في القروض الصغيرة.",
    "A healthcare startup needed a lightweight, offline-capable patient management system for rural clinics with limited internet connectivity. Our AI matched 6 contributors with expertise in offline-first architecture, healthcare compliance, and mobile development.": "احتاجت شركة ناشئة في مجال الرعاية الصحية إلى نظام خفيف قادر على العمل دون اتصال لإدارة المرضى للعيادات الريفية ذات الاتصال المحدود بالإنترنت. طابق الذكاء الاصطناعي لدينا 6 مساهمين ذوي خبرة في البنية الأولى دون اتصال، والامتثال للرعاية الصحية، وتطوير الهاتف المحمول.",
    "A micro company of 4 developers created a mobile app to help individuals track and reduce their carbon footprint with AI-powered recommendations.": "أنشأت شركة صغيرة من 4 مطورين تطبيقاً للهاتف المحمول لمساعدة الأفراد على تتبع وتقليل بصمتهم الكربونية بتوصيات مدعومة بالذكاء الاصطناعي.",
    "A social enterprise wanted to create a transparent microfinance platform using blockchain technology to serve underbanked communities. The challenge required expertise in blockchain, smart contracts, and financial systems.": "أرادت مؤسسة اجتماعية إنشاء منصة تمويل أصغر شفافة باستخدام تقنية blockchain لخدمة المجتمعات المحرومة من الخدمات المصرفية. تطلب التحدي خبرة في blockchain والعقود الذكية والأنظمة المالية.",
    "A team of 5 contributors built a complete e-commerce solution including product catalog, cart, checkout, and payment integration in just 8 weeks.": "بنى فريق من 5 مساهمين حلاً كاملاً للتجارة الإلكترونية بما في ذلك كتالوج المنتجات، والسلة، والدفع، وتكامل الدفع في 8 أسابيع فقط.",
    "A team of 7 contributors developed a comprehensive LMS with video streaming, assessments, progress tracking, and analytics for a remote learning platform.": "طور فريق من 7 مساهمين نظام إدارة تعلم شامل مع بث الفيديو، والتقييمات، وتتبع التقدم، والتحليلات لمنصة تعلم عن بعد.",
    "AI": "الذكاء الاصطناعي",
    "AI & Technology": "الذكاء الاصطناعي والتقنية",
    "AI (40%) + Community (60%)": "الذكاء الاصطناعي (40%) + المجتمع (60%)",
    "AI Analysis": "تحليل الذكاء الاصطناعي",
    "AI Analysis Workflow": "سير عمل تحليل الذكاء الاصطناعي",
    "AI Analysis in Progress...": "تحليل الذكاء الاصطناعي قيد التنفيذ...",
    "AI Analysis:": "تحليل الذكاء الاصطناعي:",
    "AI Evaluation": "تقييم الذكاء الاصطناعي",
    "AI Features": "ميزات الذكاء الاصطناعي",
    "AI CV Parsing": "تحليل السيرة الذاتية بالذكاء الاصطناعي",
    "AI Team Matching": "مطابقة الفريق بالذكاء الاصطناعي",
    "AI Task Decomposition": "تقسيم المهام بالذكاء الاصطناعي",
    "AI Challenge Analysis": "تحليل التحديات بالذكاء الاصطناعي",
    "AI-powered functionality settings": "إعدادات الوظائف المدعومة بالذكاء الاصطناعي",
    "AI Feedback:": "ملاحظات الذكاء الاصطناعي:",
    "AI Score": "نتيجة الذكاء الاصطناعي",
    "AI Score:": "نتيجة الذكاء الاصطناعي:",
    "AI Technology": "تقنية الذكاء الاصطناعي",
    "AI creates balanced teams with complementary skills, optimal size (3-7 members), and clear leadership.": "ينشئ الذكاء الاصطناعي فرقاً متوازنة بمهارات متكاملة، وحجم مثالي (3-7 أعضاء)، وقيادة واضحة.",
    "AI creates optimal \"micro companies\" with contributors matched to specific roles and tasks.": "ينشئ الذكاء الاصطناعي \"شركات صغيرة\" مثالية مع مساهمين مطابقين لأدوار ومهام محددة.",
    "AI evaluation in progress...": "تقييم الذكاء الاصطناعي قيد التنفيذ...",
    "AI matches qualified contributors to each task": "يطابق الذكاء الاصطناعي المساهمين المؤهلين لكل مهمة",
    "AI matches you to tasks that align with your skills and interests. Receive team invitations for challenges.": "يطابقك الذكاء الاصطناعي مع المهام التي تتوافق مع مهاراتك واهتماماتك. تلقى دعوات الفريق للتحديات.",
    "AI selects leaders based on experience level, reputation score, skill breadth, and leadership history. Leaders coordinate team efforts, facilitate communication, and have visibility into the full challenge scope and strategic context.": "يختار الذكاء الاصطناعي القادة بناءً على مستوى الخبرة ونقاط السمعة واتساع المهارات وتاريخ القيادة. ينسق القادة جهود الفريق ويسهلون التواصل ولديهم رؤية كاملة لنطاق التحدي والسياق الاستراتيجي.",
    "AI will analyze and refine your challenge brief": "سيقوم الذكاء الاصطناعي بتحليل وتحسين ملخص التحدي الخاص بك",
    "AI will evaluate your idea across multiple dimensions (feasibility, innovation, impact)": "سيقوم الذكاء الاصطناعي بتقييم فكرتك عبر أبعاد متعددة (الجدوى، الابتكار، التأثير)",
    "AI-Analyzed Task Requirements": "متطلبات المهمة المُحللة بالذكاء الاصطناعي",
    "AI-Assembled Teams": "فرق مجمعة بالذكاء الاصطناعي",
    "AI-Powered Challenge Platform": "منصة التحديات المدعومة بالذكاء الاصطناعي",
    "AI-Powered Collaboration Platform": "منصة التعاون المدعومة بالذكاء الاصطناعي",
    "AI-Powered Matching": "مطابقة بالذكاء الاصطناعي",
    "AI-Powered Team Formation": "تشكيل الفريق بالذكاء الاصطناعي",
    "AI-Refined Brief": "ملخص مُحسّن بالذكاء الاصطناعي",
    "AI-formed team of 3-7 contributors with complementary skills, created specifically to solve a challenge. Each member has a defined role and responsibilities, working together like a small startup focused on one project.": "فريق مُشكّل بالذكاء الاصطناعي من 3-7 مساهمين بمهارات متكاملة، تم إنشاؤه خصيصاً لحل تحدي. كل عضو لديه دور ومسؤوليات محددة، يعملون معاً مثل شركة ناشئة صغيرة تركز على مشروع واحد.",
    "AI-powered challenge analysis and task decomposition using natural language processing": "تحليل التحديات وتقسيم المهام بالذكاء الاصطناعي باستخدام معالجة اللغة الطبيعية",
    "AI-powered platform connecting talented contributors with real-world challenges": "منصة تعمل بالذكاء الاصطناعي تربط المساهمين الموهوبين بالتحديات الواقعية",
    "AI-powered skill matching": "مطابقة المهارات بالذكاء الاصطناعي",
    "AI-powered task decomposition": "تقسيم المهام بالذكاء الاصطناعي",
    "AI-powered task decomposition and contributor matching": "تقسيم المهام ومطابقة المساهمين بالذكاء الاصطناعي",
    "API Documentation": "توثيق API",
    "API Settings": "إعدادات API",
    "API Access": "الوصول إلى API",
    "API Rate Limit": "حد معدل API",
    "Public API Documentation": "توثيق API العام",
    "API access and rate limiting": "الوصول إلى API وتحديد المعدل",
    "API requests are rate-limited to ensure fair usage and system stability.": "طلبات API محدودة المعدل لضمان الاستخدام العادل واستقرار النظام.",
    "About": "حول",
    "About Community Challenges": "حول تحديات المجتمع",
    "About Me": "عني",
    "About Mindova": "حول ميندوفا",
    "About Us": "من نحن",
    "Accept": "قبول",
    "Accept Assignment": "قبول التكليف",
    "Accept Challenge": "قبول التحدي",
    "Accept Invitation": "قبول الدعوة",
    "Accept Team Invitation": "قبول دعوة الفريق",
    "Accept invitations to join micro companies. Collaborate with other talented contributors on meaningful work.": "قبول الدعوات للانضمام إلى الشركات الصغيرة. تعاون مع مساهمين موهوبين آخرين في عمل هادف.",
    "Accept only tasks they can reasonably complete": "قبول المهام التي يمكنهم إكمالها بشكل معقول فقط",
    "Accepted": "مقبول",
    "Access": "الوصول",
    "Access Denied": "الوصول مرفوض",
    "Access diverse talent, solve complex problems cost-effectively, and benefit from AI-optimized team formation and project management. Get results faster with perfectly matched contributors.": "الوصول إلى مواهب متنوعة، حل المشاكل المعقدة بفعالية من حيث التكلفة، والاستفادة من تشكيل الفرق وإدارة المشاريع المُحسّنة بالذكاء الاصطناعي. احصل على نتائج أسرع مع مساهمين متطابقين تمامًا.",
    "Access to diverse talent": "الوصول إلى مواهب متنوعة",
    "Account": "الحساب",
    "Account Information": "معلومات الحساب",
    "Account Settings": "إعدادات الحساب",
    "Account Type": "نوع الحساب",
    "Accuracy of AI-generated matches and recommendations": "دقة المطابقات والتوصيات التي ينشئها الذكاء الاصطناعي",
    "Accurately represent their skills and experience": "تمثيل مهاراتهم وخبراتهم بدقة",
    "Achievement": "إنجاز",
    "Achievements": "الإنجازات",
    "Actions": "الإجراءات",
    "Active": "نشط",
    "Active Challenges": "التحديات النشطة",
    "Active Contributors": "المساهمون النشطون",
    "Active Now": "نشط الآن",
    "Active Task in Progress": "مهمة نشطة قيد التنفيذ",
    "Active Tasks": "المهام النشطة",
    "Active Teams": "الفرق النشطة",
    "Active Contributor": "مساهم نشط",
    "Active Contributors": "مساهمون نشطون",
    "Activities": "الأنشطة",
    "Activity": "النشاط",
    "Actual Size": "الحجم الفعلي",
    "Additional Challenge-Specific Terms:": "شروط إضافية خاصة بالتحدي:",
    "Address": "العنوان",
    "Admin": "مدير",
    "Admin Dashboard": "لوحة تحكم المشرف",
    "Admin Panel": "لوحة المشرف",
    "Admin Login": "تسجيل دخول المشرف",
    "Advanced": "متقدم",
    "Advanced AI": "ذكاء اصطناعي متقدم",
    "Advanced algorithms for optimal contributor-task pairing with 80%+ accuracy": "خوارزميات متقدمة لمطابقة مثالية بين المساهم والمهمة بدقة تزيد عن 80%",
    "Advanced algorithms form optimal teams based on skills and experience": "خوارزميات متقدمة تشكل فرقًا مثالية بناءً على المهارات والخبرة",
    "Advanced algorithms match contributor skills, experience, and availability to task requirements with 80%+ accuracy.": "تطابق الخوارزميات المتقدمة مهارات المساهمين وخبراتهم وتوافرهم مع متطلبات المهام بدقة تزيد عن 80%.",
    "Agreement": "الاتفاقية",
    "Aisha Patel": "عائشة باتل",
    "Album": "ألبوم",
    "Albums": "الألبومات",
    "Align Center": "محاذاة للوسط",
    "Align Left": "محاذاة لليسار",
    "Align Right": "محاذاة لليمين",
    "Alignment": "التوافق",
    "All": "الكل",
    "All API requests must include an authentication token in the Authorization header.": "يجب أن تتضمن جميع طلبات API رمز مصادقة في رأس Authorization.",
    "All Platform content, including but not limited to text, graphics, logos, and software, is the property of Mindova and protected by intellectual property laws.": "جميع محتويات المنصة، بما في ذلك على سبيل المثال لا الحصر النصوص والرسومات والشعارات والبرامج، هي ملكية Mindova ومحمية بموجب قوانين الملكية الفكرية.",
    "All Posts": "جميع المنشورات",
    "All Rankings": "جميع التصنيفات",
    "All Rights Reserved": "جميع الحقوق محفوظة",
    "All Statuses": "جميع الحالات",
    "All Types": "جميع الأنواع",
    "All challenges submitted to Mindova are protected under challenge-specific NDAs, ensuring full confidentiality and controlled access.": "جميع التحديات المقدمة إلى ميندوفا محمية بموجب اتفاقيات سرية خاصة بالتحدي، مما يضمن السرية الكاملة والوصول المُتحكم فيه.",
    "All time": "طوال الوقت",
    "All contributors must sign a general NDA before participating in challenges. This protects both you and the companies sharing their confidential information on our platform.": "يجب على جميع المساهمين التوقيع على اتفاقية سرية عامة قبل المشاركة في التحديات. هذا يحمي كلاً منك ومن الشركات التي تشارك معلوماتها السرية على منصتنا.",
    "All contributors must sign a general NDA upon registration": "يجب على جميع المساهمين التوقيع على اتفاقية سرية عامة عند التسجيل",
    "Already have an account?": "لديك حساب بالفعل؟",
    "An inside look at how we extract and categorize skills from resumes using natural language processing and machine learning.": "نظرة من الداخل على كيفية استخراج وتصنيف المهارات من السير الذاتية باستخدام معالجة اللغة الطبيعية والتعلم الآلي.",
    "Analytics": "التحليلات",
    "Analyze & Decompose Challenges": "تحليل وتقسيم التحديات",
    "Analyzing": "جاري التحليل",
    "Analyzing Challenge Brief...": "جاري تحليل ملخص التحدي...",
    "Analyzing...": "جاري التحليل...",
    "Announcement": "إعلان",
    "Announcements": "الإعلانات",
    "Anonymous Updates:": "تحديثات مجهولة:",
    "Answer": "إجابة",
    "Answers": "الإجابات",
    "Any disputes arising from these Terms shall be resolved through binding arbitration in accordance with applicable laws. Users agree to resolve disputes individually and waive the right to participate in class actions.": "يجب حل أي نزاعات تنشأ عن هذه الشروط من خلال التحكيم الملزم وفقاً للقوانين المعمول بها. يوافق المستخدمون على حل النزاعات بشكل فردي والتنازل عن الحق في المشاركة في الدعاوى الجماعية.",
    "Apply": "تطبيق",
    "Apply Filters": "تطبيق الفلاتر",
    "Approve": "موافقة",
    "Archive": "الأرشيف",
    "Archived": "مؤرشف",
    "Are you sure you want to decline this invitation?": "هل أنت متأكد أنك تريد رفض هذه الدعوة؟",
    "Are you sure?": "هل أنت متأكد؟",
    "Areas for Improvement:": "مجالات التحسين:",
    "Areas to Develop:": "مجالات التطوير:",
    "Areas to develop:": "مجالات التطوير:",
    "As a designer, I loved being matched with projects that valued good UX. Working in micro companies taught me how to collaborate with developers effectively and see my designs come to life in real products.": "كمصممة، أحببت مطابقتي مع مشاريع تقدر تجربة المستخدم الجيدة. علمني العمل في الشركات الصغيرة كيفية التعاون بفعالية مع المطورين ورؤية تصميماتي تنبض بالحياة في منتجات حقيقية.",
    "Aspect Ratio": "نسبة العرض إلى الارتفاع",
    "Assigned Contributors": "المساهمون المُكلفون",
    "Assignment": "تكليف",
    "Assignments": "التكليفات",
    "Attachment": "مرفق",
    "Attachments": "المرفقات",
    "Attachments (Optional)": "المرفقات (اختياري)",
    "Authenticated requests:": "الطلبات المصادق عليها:",
    "Authentication": "المصادقة",
    "Automated creation of balanced, high-performing teams with complementary skills": "إنشاء تلقائي لفرق متوازنة وعالية الأداء بمهارات تكميلية",
    "Automatic Protection:": "الحماية التلقائية:",
    "Availability (hours per week)": "التوافر (ساعات في الأسبوع)",
    "Availability (hours\/week)": "التوافر (ساعات\/أسبوع)",
    "Available": "متاح",
    "Available Tasks": "المهام المتاحة",
    "Available Tasks for You": "المهام المتاحة لك",
    "Available tasks will appear in your dashboard once AI analysis matches you with suitable challenges based on your uploaded CV.": "ستظهر المهام المتاحة في لوحة التحكم الخاصة بك بمجرد أن يطابقك تحليل الذكاء الاصطناعي مع التحديات المناسبة بناءً على سيرتك الذاتية المحملة.",
    "Avatar": "الصورة الرمزية",
    "Avg AI Score": "متوسط نتيجة الذكاء الاصطناعي",
    "Avg Response Time": "متوسط وقت الاستجابة",
    "Awaiting response": "في انتظار الرد",
    "Back": "رجوع",
    "Back to Challenge": "العودة إلى التحدي",
    "Back to Dashboard": "العودة إلى لوحة التحكم",
    "Back to Login": "العودة إلى تسجيل الدخول",
    "Background Color": "لون الخلفية",
    "Bad Request - Invalid parameters": "طلب خاطئ - معاملات غير صالحة",
    "Badge": "شارة",
    "Badges": "الشارات",
    "Base URL": "عنوان URL الأساسي",
    "Basic": "أساسي",
    "Basic platform configuration": "الإعدادات الأساسية للمنصة",
    "Be the first to make an impact!": "كن أول من يُحدث تأثيرًا!",
    "Be the first to share your idea!": "كن أول من يشارك فكرته!",
    "Beginner": "مبتدئ",
    "Being worked on": "قيد العمل",
    "Best Practices": "أفضل الممارسات",
    "Best Practices for Remote Collaboration": "أفضل الممارسات للتعاون عن بعد",
    "Best practices": "أفضل الممارسات",
    "Bio": "السيرة الذاتية",
    "Bio (Optional)": "السيرة الذاتية (اختياري)",
    "Blockchain-Based Microfinance Platform": "منصة تمويل أصغر قائمة على Blockchain",
    "Blocked": "محظور",
    "Blog": "المدونة",
    "Board": "لوحة",
    "Boards": "اللوحات",
    "Bold": "عريض",
    "Breach of this agreement may result in legal action": "قد ينتج عن خرق هذه الاتفاقية إجراء قانوني",
    "Break down complex problems into manageable tasks using advanced AI analysis and strategic planning.": "تقسيم المشاكل المعقدة إلى مهام قابلة للإدارة باستخدام تحليل الذكاء الاصطناعي المتقدم والتخطيط الاستراتيجي.",
    "Brightness": "السطوع",
    "Browse": "تصفح",
    "Browse Challenges": "تصفح التحديات",
    "Browser information": "معلومات المتصفح",
    "Bug": "خطأ",
    "Bug reports are confidential and used only to improve the platform.": "تقارير الأخطاء سرية وتستخدم فقط لتحسين المنصة.",
    "Bugs": "الأخطاء",
    "Build Your Reputation": "ابنِ سمعتك",
    "Build your portfolio while contributing to meaningful projects": "ابنِ مجموعة أعمالك أثناء المساهمة في مشاريع هادفة",
    "Build your portfolio, gain real-world experience, and make a meaningful impact while working on challenges that match your skills and interests. Grow your reputation and network with professionals.": "ابنِ معرضك، واكتسب خبرة واقعية، وأحدث تأثيرًا مُجديًا أثناء العمل على تحديات تتناسب مع مهاراتك واهتماماتك. نمّي سمعتك وشبكتك مع المحترفين.",
    "Building Your Developer Portfolio": "بناء مجموعة أعمال المطور الخاصة بك",
    "Built on": "مبني على",
    "Built-in tools for seamless teamwork, real-time communication, and progress tracking throughout your journey.": "أدوات مدمجة للعمل الجماعي السلس والتواصل الفوري وتتبع التقدم طوال رحلتك.",
    "Bulk Actions": "إجراءات جماعية",
    "Business": "الأعمال",
    "Business Partnership": "شراكة تجارية",
    "Business Partnerships": "الشراكات التجارية",
    "Button": "زر",
    "Buttons": "الأزرار",
    "By accessing and using Mindova (\"the Platform\"), you accept and agree to be bound by the terms and provision of this agreement. If you do not agree to these Terms of Service, please do not use the Platform.": "بالوصول إلى واستخدام Mindova (\"المنصة\")، فإنك تقبل وتوافق على الالتزام بشروط وأحكام هذه الاتفاقية. إذا كنت لا توافق على شروط الخدمة هذه، يرجى عدم استخدام المنصة.",
    "By checking this box and submitting this form, you are electronically signing this agreement and agree to be legally bound by its terms.": "بتحديد هذا المربع وإرسال هذا النموذج، فإنك توقع هذه الاتفاقية إلكترونيًا وتوافق على الالتزام القانوني بشروطها.",
    "By checking this box and submitting this form, you are electronically signing this agreement and agree to be legally bound by its terms. You acknowledge that:": "بتحديد هذا المربع وإرسال هذا النموذج، فإنك توقع هذه الاتفاقية إلكترونيًا وتوافق على الالتزام القانوني بشروطها. أنت تُقر بأن:",
    "By clicking OK, you confirm that you have read and understood the NDA and agree to be legally bound by its terms. Do you wish to proceed?": "بالنقر على موافق، فإنك تؤكد أنك قرأت وفهمت اتفاقية السرية وتوافق على الالتزام القانوني بشروطها. هل ترغب في المتابعة؟",
    "By clicking OK, you confirm that you have read and understood the challenge-specific NDA and agree to be legally bound by its terms.\n\nYou acknowledge that unauthorized disclosure of challenge information may result in legal consequences.\n\nDo you wish to proceed?": "بالنقر على موافق، فإنك تؤكد أنك قرأت وفهمت اتفاقية السرية الخاصة بالتحدي وتوافق على الالتزام القانوني بشروطها.\n\nأنت تُقر بأن الكشف غير المصرح به عن معلومات التحدي قد ينتج عنه عواقب قانونية.\n\nهل ترغب في المتابعة؟",
    "By continuing, you agree to our": "بالمتابعة، فإنك توافق على",
    "By using Mindova, you acknowledge that you have read, understood, and agree to be bound by these Terms of Service.": "باستخدام Mindova، فإنك تقر بأنك قد قرأت وفهمت ووافقت على الالتزام بشروط الخدمة هذه.",
    "CEO, TechStartup Inc.": "الرئيس التنفيذي، TechStartup Inc.",
    "COMPLETED": "مكتمل",
    "CONFIDENTIALITY LEVEL": "مستوى السرية",
    "CRITICAL": "حرج",
    "CV": "السيرة الذاتية",
    "CV Analysis Status": "حالة تحليل السيرة الذاتية",
    "CV:": "السيرة الذاتية:",
    "Calendar": "التقويم",
    "Can I leave a team?": "هل يمكنني مغادرة الفريق؟",
    "Can I see who's on my teams?": "هل يمكنني رؤية من في فرقي؟",
    "Can't find what you're looking for? Our support team is here to help!": "لا يمكنك العثور على ما تبحث عنه؟ فريق الدعم لدينا هنا للمساعدة!",
    "Cancel": "إلغاء",
    "Caption": "التسمية التوضيحية",
    "Captions": "التسميات التوضيحية",
    "Carbon Footprint Tracker": "متتبع البصمة الكربونية",
    "Card": "بطاقة",
    "Cards": "البطاقات",
    "Categories": "الفئات",
    "Category": "الفئة",
    "Celebrating the top contributors making impact on Mindova": "الاحتفاء بأهم المساهمين الذين يُحدثون تأثيرًا في ميندوفا",
    "Cell": "خلية",
    "Cells": "الخلايا",
    "Certification": "شهادة",
    "Certifications": "الشهادات",
    "Challenge": "تحدي",
    "Challenge Analysis": "تحليل التحدي",
    "Challenge Analysis Complete": "اكتمل تحليل التحدي",
    "Challenge Settings": "إعدادات التحديات",
    "Challenge Approval Required": "موافقة التحدي مطلوبة",
    "Challenges Enabled": "التحديات مفعّلة",
    "Configure challenge behavior and limits": "تكوين سلوك التحديات والحدود",
    "Challenge Description": "وصف التحدي",
    "Challenge Details": "تفاصيل التحدي",
    "Challenge ID:": "معرّف التحدي:",
    "Challenge Info": "معلومات التحدي",
    "Challenge Submission:": "تقديم التحدي:",
    "Challenge Timeline": "الجدول الزمني للتحدي",
    "Challenge Title": "عنوان التحدي",
    "Challenge Types": "أنواع التحديات",
    "Challenge posting and management tools for companies": "أدوات نشر وإدارة التحديات للشركات",
    "Challenge-Specific NDA": "اتفاقية سرية خاصة بالتحدي",
    "Challenge-Specific NDA:": "اتفاقية سرية خاصة بالتحدي:",
    "Challenge:": "التحدي:",
    "Challenges": "التحديات",
    "Challenges Completed": "التحديات المكتملة",
    "Challenges Management": "إدارة التحديات",
    "Challenges Solved": "تحديات تم حلها",
    "Challenges are matched to your field of expertise for relevant discussion opportunities.": "يتم مطابقة التحديات مع مجال خبرتك لفرص مناقشة ذات صلة.",
    "Champions": "الأبطال",
    "Change Language": "تغيير اللغة",
    "Change Password": "تغيير كلمة المرور",
    "Changelog": "سجل التغييرات",
    "Chart": "الرسم البياني",
    "Charts": "الرسوم البيانية",
    "Chat": "المحادثة",
    "Check back in a few minutes": "تحقق مرة أخرى بعد بضع دقائق",
    "Check back later for challenges that need community input and discussion.": "تحقق لاحقًا من التحديات التي تحتاج إلى مساهمة ومناقشة من المجتمع.",
    "Check out our Help Center for instant answers to common questions": "راجع مركز المساعدة للحصول على إجابات فورية للأسئلة الشائعة",
    "Check this if you couldn't complete your task": "حدد هذا إذا لم تتمكن من إكمال مهمتك",
    "Checkbox": "مربع اختيار",
    "Chemical Engineering": "الهندسة الكيميائية",
    "Choose Photo": "اختر صورة",
    "Choose a strong password to protect your account and data.": "اختر كلمة مرور قوية لحماية حسابك وبياناتك.",
    "Choose what email notifications you'd like to receive": "اختر إشعارات البريد الإلكتروني التي ترغب في تلقيها",
    "City": "المدينة",
    "Clear": "مسح",
    "Clear All": "مسح الكل",
    "Clear Filters": "مسح الفلاتر",
    "Click \"Get Started\" and choose either Contributor or Company account. Fill in your details or sign up with LinkedIn for faster registration. You'll need to provide basic information and upload your CV if you're registering as a contributor.": "انقر على \"ابدأ\" واختر حساب مساهم أو شركة. املأ تفاصيلك أو سجل باستخدام LinkedIn للتسجيل الأسرع. ستحتاج إلى تقديم معلومات أساسية وتحميل سيرتك الذاتية إذا كنت تسجل كمساهم.",
    "Close": "إغلاق",
    "Closed": "مغلق",
    "Code": "كود",
    "Collaborate with the community to refine and improve these challenges through discussion and feedback": "تعاون مع المجتمع لتحسين وتطوير هذه التحديات من خلال المناقشة والملاحظات",
    "Collaborative Innovation": "الابتكار التعاوني",
    "Collapse": "طي",
    "Color": "اللون",
    "Column": "عمود",
    "Columns": "الأعمدة",
    "Coming Soon": "قريباً",
    "Comment": "تعليق",
    "Comments": "التعليقات",
    "Comments scored 7+ by AI boost your reputation and get noticed by challenge owners.": "التعليقات التي حصلت على 7+ من الذكاء الاصطناعي تعزز سمعتك وتلفت انتباه أصحاب التحديات.",
    "Commercial Register Number": "رقم السجل التجاري",
    "Communicate availability and capacity honestly": "التواصل بصدق حول التوفر والقدرة",
    "Community": "المجتمع",
    "Community Features": "ميزات المجتمع",
    "Community features and social settings": "ميزات المجتمع والإعدادات الاجتماعية",
    "Public Profiles": "الملفات الشخصية العامة",
    "Comments": "التعليقات",
    "Voting": "التصويت",
    "Community Challenges": "تحديات المجتمع",
    "Community Discussion": "مناقشة المجتمع",
    "Community Education": "تعليم المجتمع",
    "Community Guidelines": "إرشادات المجتمع",
    "Community Guidelines →": "إرشادات المجتمع ←",
    "Community Ideas": "أفكار المجتمع",
    "Community Says": "يقول المجتمع",
    "Community Votes": "أصوات المجتمع",
    "Community members can vote on your idea": "يمكن لأعضاء المجتمع التصويت على فكرتك",
    "Community standing": "المكانة في المجتمع",
    "Companies": "الشركات",
    "Companies Management": "إدارة الشركات",
    "Companies agree to:": "توافق الشركات على:",
    "Company": "الشركة",
    "Company Accounts": "حسابات الشركات",
    "Company Accounts:": "حسابات الشركات:",
    "Company Logo": "شعار الشركة",
    "Company Logo (Optional)": "شعار الشركة (اختياري)",
    "Company Name": "اسم الشركة",
    "Company Profile": "ملف الشركة",
    "Complete": "إكمال",
    "Complete Guide to Mindova": "دليل كامل لـ Mindova",
    "Complete Profile": "إكمال الملف الشخصي",
    "Complete Profile & Continue to NDA": "إكمال الملف الشخصي والمتابعة إلى اتفاقية السرية",
    "Complete Task": "إكمال المهمة",
    "Complete Your": "أكمل",
    "Complete Your Profile": "أكمل ملفك الشخصي",
    "Complete accepted tasks and commitments in good faith": "إكمال المهام والالتزامات المقبولة بحسن نية",
    "Complete analysis takes 15-20 minutes total: brief analysis (3 min), complexity evaluation (3 min), task decomposition (5 min), and team formation (10 min). You'll receive notifications at each stage and can monitor progress in your dashboard.": "يستغرق التحليل الكامل 15-20 دقيقة إجمالاً: التحليل الموجز (3 دقائق)، تقييم التعقيد (3 دقائق)، تقسيم المهام (5 دقائق)، وتشكيل الفريق (10 دقائق). ستتلقى إشعارات في كل مرحلة ويمكنك مراقبة التقدم في لوحة التحكم الخاصة بك.",
    "Complete your active task first": "أكمل مهمتك النشطة أولاً",
    "Complete your current task before joining new teams. You can only work on one task at a time.": "أكمل مهمتك الحالية قبل الانضمام إلى فرق جديدة. يمكنك العمل على مهمة واحدة فقط في كل مرة.",
    "Completed": "مكتمل",
    "Completed Challenges": "التحديات المكتملة",
    "Completed Tasks": "المهام المكتملة",
    "Completed Work": "العمل المكتمل",
    "Completion Deadline": "الموعد النهائي للإنجاز",
    "Completion Rate": "معدل الإنجاز",
    "Complex": "معقد",
    "Complexity": "التعقيد",
    "Complexity & Priority": "التعقيد والأولوية",
    "Complexity Evaluation (Pending)": "تقييم التعقيد (قيد الانتظار)",
    "Complexity Evaluation:": "تقييم التعقيد:",
    "Complexity Level": "مستوى التعقيد",
    "Complexity Levels": "مستويات التعقيد",
    "Complexity:": "التعقيد:",
    "Confidence:": "الثقة:",
    "Confidentiality": "السرية",
    "Confidentiality Level:": "مستوى السرية:",
    "Configuration": "التكوين",
    "Configure notifications you see in the platform": "تكوين الإشعارات التي تراها في المنصة",
    "Confirm": "تأكيد",
    "Confirm Password": "تأكيد كلمة المرور",
    "Confirm your new password": "تأكيد كلمة المرور الجديدة",
    "Confusing flow": "تدفق محير",
    "Congratulations! Your solution met the quality standards and has been approved.": "تهانينا! حلك استوفى معايير الجودة وتم الموافقة عليه.",
    "Connect skilled contributors with projects that align perfectly with their expertise and career goals.": "ربط المساهمين المهرة بمشاريع تتوافق تمامًا مع خبراتهم وأهدافهم المهنية.",
    "Connect with talented contributors or post challenges. Our AI-powered platform creates perfect teams for real-world projects.": "تواصل مع مساهمين موهوبين أو انشر تحديات. منصتنا المدعومة بالذكاء الاصطناعي تنشئ فرقًا مثالية لمشاريع واقعية.",
    "Contact": "اتصل بنا",
    "Contact Developer Support": "اتصل بدعم المطورين",
    "Contact Information": "معلومات الاتصال",
    "Contact Sales": "تواصل مع المبيعات",
    "Contact Support": "اتصل بالدعم",
    "Contact Support →": "اتصل بالدعم ←",
    "Contact Us": "اتصل بنا",
    "Contact our support team": "اتصل بفريق الدعم لدينا",
    "Continue": "استمر",
    "Continue with LinkedIn": "المتابعة بواسطة لينكد إن",
    "Continue your journey of solving challenges and making an impact with talented teams worldwide.": "استمر في رحلتك لحل التحديات وإحداث تأثير مع فرق موهوبة حول العالم.",
    "Contrast": "التباين",
    "Contribute skills to challenges": "ساهم بمهاراتك في التحديات",
    "Contributors": "المساهمون",
    "Copy": "نسخ",
    "Copy to": "نسخ إلى",
    "Core Values": "القيم الأساسية",
    "Cost-effective solutions": "حلول فعالة من حيث التكلفة",
    "Country": "الدولة",
    "Cover Photo": "صورة الغلاف",
    "Covered Skills": "المهارات المشمولة",
    "Create": "إنشاء",
    "Create Account": "إنشاء حساب",
    "Create Challenge": "إنشاء تحدي",
    "Create Team": "إنشاء فريق",
    "Create a New": "إنشاء جديد",
    "Create a free account": "إنشاء حساب مجاني",
    "Create a new challenge. Requires company account.": "إنشاء تحدي جديد. يتطلب حساب شركة.",
    "Create balanced \"micro companies\" with complementary skills for collaborative problem-solving.": "إنشاء \"شركات صغيرة\" متوازنة بمهارات تكميلية لحل المشاكل التعاونية.",
    "Create your profile and upload your CV. Our AI analyzes your skills, experience, and expertise.": "أنشئ ملفك الشخصي وحمّل سيرتك الذاتية. يحلل الذكاء الاصطناعي لدينا مهاراتك وخبرتك وخبرتك.",
    "Created": "تم الإنشاء",
    "Created - Resource created successfully": "تم الإنشاء - تم إنشاء المورد بنجاح",
    "Created At": "تم الإنشاء في",
    "Crop": "قص",
    "Current Password": "كلمة المرور الحالية",
    "Custom Range": "نطاق مخصص",
    "Customize": "تخصيص",
    "Cut": "قص",
    "Cutting-Edge AI": "الذكاء الاصطناعي المتطور",
    "Daily digest": "ملخص يومي",
    "Danger Zone": "منطقة الخطر",
    "Dark Mode": "الوضع الداكن",
    "Dashboard": "لوحة التحكم",
    "Dashboard Active": "لوحة التحكم نشطة",
    "Data": "البيانات",
    "Data Protected": "البيانات محمية",
    "Date": "التاريخ",
    "Date and time of signing": "تاريخ ووقت التوقيع",
    "Date and time:": "التاريخ والوقت:",
    "David K.": "ديفيد ك.",
    "Deadline": "الموعد النهائي",
    "Deadlines": "المواعيد النهائية",
    "Decline": "رفض",
    "Decline Assignment": "رفض التكليف",
    "Decline Team Invitation": "رفض دعوة الفريق",
    "Decline an invitation to join a team.": "رفض دعوة للانضمام إلى فريق.",
    "Declined": "مرفوض",
    "Declined Invitations": "الدعوات المرفوضة",
    "Decomposing into Tasks...": "جاري التقسيم إلى مهام...",
    "Decrease Indent": "تقليل المسافة البادئة",
    "Deep dive into projects that made a real-world impact": "تعمق في المشاريع التي أحدثت تأثيراً في العالم الحقيقي",
    "Delete": "حذف",
    "Delete Account": "حذف الحساب",
    "Delete Challenge": "حذف التحدي",
    "Deleted": "تم الحذف",
    "Deliver Solutions": "تقديم الحلول",
    "Deliver work that meets agreed-upon standards": "تقديم عمل يلبي المعايير المتفق عليها",
    "Deliverable URL (GitHub, CodePen, Live Demo, etc.)": "رابط التسليم (GitHub، CodePen، عرض حي، إلخ.)",
    "Describe your challenge in detail (minimum 100 characters)...": "صف تحديك بالتفصيل (100 حرف على الأقل)...",
    "Describe your challenge in detail. What problem are you trying to solve? What are your goals?": "صف تحديك بالتفصيل. ما المشكلة التي تحاول حلها؟ ما هي أهدافك؟",
    "Describe your idea in detail...": "صف فكرتك بالتفصيل...",
    "Describe your solution, the approach you took, and any key decisions...": "صف حلك، النهج الذي اتخذته، وأي قرارات رئيسية...",
    "Description": "الوصف",
    "Deselect All": "إلغاء تحديد الكل",
    "Design": "التصميم",
    "Designs": "التصاميم",
    "Detailed insights and progress metrics": "رؤى تفصيلية ومقاييس التقدم",
    "Details": "التفاصيل",
    "Difficulty": "الصعوبة",
    "Digital Signature Information:": "معلومات التوقيع الرقمي:",
    "Digital Signature Notice:": "إشعار التوقيع الرقمي:",
    "Dimensions": "الأبعاد",
    "Director, GreenFuture NGO": "المدير، GreenFuture NGO",
    "Disabled": "معطّل",
    "Discard Changes": "تجاهل التغييرات",
    "Discover": "اكتشف",
    "Discover how our advanced AI algorithms create optimal teams by analyzing skills, experience, and collaboration patterns.": "اكتشف كيف تنشئ خوارزميات الذكاء الاصطناعي المتقدمة لدينا فرقاً مثالية من خلال تحليل المهارات والخبرة وأنماط التعاون.",
    "Discuss": "مناقشة",
    "Discussion": "المناقشة",
    "Discussions": "المناقشات",
    "Dislike": "عدم إعجاب",
    "Disputes between users": "النزاعات بين المستخدمين",
    "Document": "مستند",
    "Documentation": "التوثيق",
    "Documents": "المستندات",
    "Don't have an account?": "ليس لديك حساب؟",
    "Done!": "تم!",
    "Download": "تحميل",
    "Download CV": "تحميل السيرة الذاتية",
    "Downvote": "تصويت سلبي",
    "Dr. James Wilson": "د. جيمس ويلسون",
    "Draft": "مسودة",
    "Drafts": "المسودات",
    "Dropdown": "قائمة منسدلة",
    "Due Date": "تاريخ الاستحقاق",
    "Due:": "الاستحقاق:",
    "Duplicate": "تكرار",
    "Duration": "المدة",
    "Duration:": "المدة:",
    "E-commerce Platform": "منصة التجارة الإلكترونية",
    "Earn rewards, badges, and recognition for quality contributions to the community": "احصل على مكافآت وشارات وتقدير للمساهمات عالية الجودة في المجتمع",
    "Easy": "سهل",
    "Edit": "تعديل",
    "Edit Challenge": "تعديل التحدي",
    "Edit Profile": "تعديل الملف الشخصي",
    "EduTech Solutions": "حلول EduTech",
    "Education": "التعليم",
    "Educational Focus:": "التركيز التعليمي:",
    "Effect": "تأثير",
    "Effects": "التأثيرات",
    "Efficiency": "الكفاءة",
    "Email": "البريد الإلكتروني",
    "Email Address": "عنوان البريد الإلكتروني",
    "Email Frequency": "تكرار البريد الإلكتروني",
    "Email Notifications": "إشعارات البريد الإلكتروني",
    "Empowering collaboration between talented contributors and forward-thinking companies": "تمكين التعاون بين المساهمين الموهوبين والشركات ذات التفكير المستقبلي",
    "Empty": "فارغ",
    "Empty Trash": "إفراغ سلة المحذوفات",
    "Enable all in-app notifications": "تفعيل جميع الإشعارات داخل التطبيق",
    "Enable contributors to build portfolios while solving real problems that make a difference.": "تمكين المساهمين من بناء معارضهم أثناء حل مشاكل حقيقية تُحدث فرقًا.",
    "Enabled": "مفعّل",
    "End Date": "تاريخ الانتهاء",
    "Engineering": "الهندسة",
    "English": "الإنجليزية",
    "Enhancement": "تحسين",
    "Enhancements": "التحسينات",
    "Enter hours (0-168)": "أدخل الساعات (0-168)",
    "Enter new password": "أدخل كلمة المرور الجديدة",
    "Enter your email": "أدخل بريدك الإلكتروني",
    "Enter your email address": "أدخل عنوان بريدك الإلكتروني",
    "Enter your email to receive a password reset link": "أدخل بريدك الإلكتروني لتلقي رابط إعادة تعيين كلمة المرور",
    "Enter your full legal name": "أدخل اسمك القانوني الكامل",
    "Enter your name": "أدخل اسمك",
    "Enter your new password below": "أدخل كلمة المرور الجديدة أدناه",
    "Enter your password": "أدخل كلمة المرور",
    "Enterprise-grade security, NDA protection, and quality assurance for every project and collaboration.": "أمان على مستوى المؤسسات، وحماية اتفاقيات السرية، وضمان الجودة لكل مشروع وتعاون.",
    "Error": "خطأ",
    "Error Codes": "رموز الخطأ",
    "Error Message": "رسالة خطأ",
    "Error Response Format": "تنسيق استجابة الخطأ",
    "Error switching language": "خطأ في تغيير اللغة",
    "Est": "تقديرًا",
    "Estimated Time": "الوقت المقدر",
    "Evaluating Complexity...": "جاري تقييم التعقيد...",
    "Event": "حدث",
    "Events": "الأحداث",
    "Exit Fullscreen": "الخروج من ملء الشاشة",
    "Expand": "توسيع",
    "Experience": "الخبرة",
    "Experience Level": "مستوى الخبرة",
    "Expert": "خبير",
    "Explain what you built and how it solves the task": "اشرح ما قمت ببنائه وكيف يحل المهمة",
    "Explain your idea in detail. How would it solve the challenge? What makes it effective?": "اشرح فكرتك بالتفصيل. كيف ستحل التحدي؟ ما الذي يجعلها فعالة؟",
    "Explore": "استكشف",
    "Explore the latest features we've added to enhance your experience, including improved matching algorithms and team analytics.": "استكشف أحدث الميزات التي أضفناها لتحسين تجربتك، بما في ذلك خوارزميات المطابقة المحسنة وتحليلات الفريق.",
    "Export": "تصدير",
    "Extracted Skills": "المهارات المستخرجة",
    "FAQ": "الأسئلة الشائعة",
    "FAQs": "الأسئلة الشائعة",
    "FAQs and guides": "الأسئلة الشائعة والأدلة",
    "Facilitate Meaningful Work": "تسهيل العمل المجدي",
    "Failed": "فشل",
    "Failed to change language. Please try again.": "فشل في تغيير اللغة. يرجى المحاولة مرة أخرى.",
    "Failed to fetch notifications:": "فشل جلب الإشعارات:",
    "Failed to mark all as read:": "فشل تحديد الكل كمقروء:",
    "Failed to mark notification as read:": "فشل تحديد الإشعار كمقروء:",
    "Failed to send message": "فشل إرسال الرسالة",
    "Failed to submit report. Please try again.": "فشل إرسال التقرير. يرجى المحاولة مرة أخرى.",
    "Feasibility": "الجدوى",
    "Feature": "ميزة",
    "Featured": "المميزة",
    "Features": "الميزات",
    "Feedback": "ملاحظات",
    "Field": "حقل",
    "Field Matching:": "مطابقة المجال:",
    "Field of Expertise": "مجال الخبرة",
    "Field of Expertise *": "مجال الخبرة *",
    "Fields": "الحقول",
    "File": "ملف",
    "File Uploads": "رفع الملفات",
    "File upload limits and allowed types": "حدود رفع الملفات والأنواع المسموحة",
    "Max File Upload Size (MB)": "الحد الأقصى لحجم الملف (ميجابايت)",
    "Allowed File Types": "أنواع الملفات المسموحة",
    "Max CV Size (MB)": "الحد الأقصى لحجم السيرة الذاتية (ميجابايت)",
    "Max Attachments Per Challenge": "الحد الأقصى للمرفقات لكل تحدي",
    "Files": "الملفات",
    "Filter": "تصفية",
    "Filter by skill...": "تصفية حسب المهارة...",
    "Filter by status": "تصفية حسب الحالة",
    "Filters": "المرشحات",
    "FinTech": "التكنولوجيا المالية",
    "Final": "نهائي",
    "Final Score": "النتيجة النهائية",
    "Final score combines AI evaluation (40%) and community votes (60%)": "النتيجة النهائية تجمع بين تقييم الذكاء الاصطناعي (40%) وأصوات المجتمع (60%)",
    "Finance": "التمويل",
    "Find answers to common questions and learn how to get the most out of Mindova": "ابحث عن إجابات للأسئلة الشائعة وتعلم كيفية تحقيق أقصى استفادة من Mindova",
    "Find the perfect challenge to showcase your skills and make meaningful impact": "اعثر على التحدي المثالي لإبراز مهاراتك وإحداث تأثير مجدي",
    "Finish": "إنهاء",
    "First": "الأول",
    "First Name": "الاسم الأول",
    "Fit to Screen": "ملائمة للشاشة",
    "Flip": "قلب",
    "Folder": "مجلد",
    "Folders": "المجلدات",
    "Follow": "متابعة",
    "Follower": "متابِع",
    "Followers": "المتابعون",
    "Following": "يتابع",
    "Font": "الخط",
    "Font Size": "حجم الخط",
    "For Companies": "للشركات",
    "For Contributors": "للمساهمين",
    "For additional support with the API, please contact our developer support team.": "للحصول على دعم إضافي مع API، يرجى الاتصال بفريق دعم المطورين لدينا.",
    "For individuals contributing skills and time to challenges": "للأفراد الذين يساهمون بمهارات ووقت للتحديات",
    "For organizations posting challenges and seeking solutions": "للمؤسسات التي تنشر التحديات وتبحث عن حلول",
    "For questions about these Terms of Service, please contact us at:": "للأسئلة حول شروط الخدمة هذه، يرجى الاتصال بنا على:",
    "Forbidden - Insufficient permissions": "محظور - أذونات غير كافية",
    "Forgot": "نسيت",
    "Forgot Password": "نسيت كلمة المرور",
    "Forgot Password?": "نسيت كلمة المرور؟",
    "Forgot password?": "نسيت كلمة المرور؟",
    "Form": "نموذج",
    "Form Optimal Teams": "تشكيل فرق مثالية",
    "Format": "التنسيق",
    "Forms": "النماذج",
    "Forum": "المنتدى",
    "From challenge submission to solution delivery": "من تقديم التحدي إلى تسليم الحل",
    "Full Legal Name": "الاسم القانوني الكامل",
    "Full Name": "الاسم الكامل",
    "Full-Stack Developer": "مطور Full-Stack",
    "Fullscreen": "ملء الشاشة",
    "GPT-4o analyzes your challenge, extracts objectives, identifies constraints, and creates a structured brief.": "يحلل GPT-4o تحديك، ويستخرج الأهداف، ويحدد القيود، وينشئ ملخصاً منظماً.",
    "Gallery": "المعرض",
    "General Inquiries": "استفسارات عامة",
    "General Inquiry": "استفسار عام",
    "General Settings": "الإعدادات العامة",
    "Get Available Tasks": "الحصول على المهام المتاحة",
    "Get Back": "العودة",
    "Get Current Contributor Profile": "الحصول على ملف المساهم الحالي",
    "Get In": "الانضمام",
    "Get Matched": "احصل على مطابقة",
    "Get My Task Assignments": "احصل على تكليفات مهامي",
    "Get Results": "احصل على النتائج",
    "Get Single Challenge": "الحصول على تحدي واحد",
    "Get Started": "ابدأ الآن",
    "Get Started Free": "ابدأ مجاناً",
    "Get Team Details": "الحصول على تفاصيل الفريق",
    "Get back to your work immediately after reset": "العودة إلى عملك مباشرة بعد إعادة التعيين",
    "Get in Touch": "تواصل معنا",
    "Get notified about changes to your assigned tasks": "احصل على إشعارات حول التغييرات في مهامك المُكلف بها",
    "Get notified immediately as things happen": "احصل على إشعارات فورية عند حدوث الأشياء",
    "Get notified when AI finishes analyzing your challenge": "احصل على إشعار عندما ينتهي الذكاء الاصطناعي من تحليل تحديك",
    "Get notified when someone submits an idea for your challenge": "احصل على إشعار عندما يقدم شخص ما فكرة لتحديك",
    "Get notified when someone votes on your ideas": "احصل على إشعار عندما يصوت شخص ما على أفكارك",
    "Get notified when tasks in your challenges are completed": "احصل على إشعار عندما تكتمل المهام في تحدياتك",
    "Get notified when you reach reputation milestones": "احصل على إشعار عندما تصل إلى معالم السمعة",
    "Get notified when you're assigned to a new task": "احصل على إشعار عندما يتم تكليفك بمهمة جديدة",
    "Get notified when your ideas are scored by AI": "احصل على إشعار عندما يُقيّم الذكاء الاصطناعي أفكارك",
    "Get personalized task recommendations and optimal team matches powered by advanced AI": "احصل على توصيات مهام مخصصة ومطابقات فرق مثالية مدعومة بالذكاء الاصطناعي المتقدم",
    "Getting Started": "البدء",
    "Go Back": "العودة",
    "Go to Dashboard": "اذهب إلى لوحة التحكم",
    "Go to page": "الذهاب إلى الصفحة",
    "Goal": "هدف",
    "Goals": "الأهداف",
    "Got it, don't show again": "فهمت، لا تعرض مرة أخرى",
    "Graph": "مخطط",
    "Graphs": "المخططات",
    "GreenFuture NGO": "GreenFuture NGO",
    "Grid": "شبكة",
    "Guide": "دليل",
    "Guides": "الأدلة",
    "HIGH": "عالي",
    "Hall of": "قاعة",
    "Hard": "صعب",
    "Have questions about this NDA?": "لديك أسئلة حول اتفاقية السرية هذه؟",
    "Heading 1": "عنوان 1",
    "Heading 2": "عنوان 2",
    "Heading 3": "عنوان 3",
    "Heading 4": "عنوان 4",
    "Heading 5": "عنوان 5",
    "Heading 6": "عنوان 6",
    "Healthcare": "الرعاية الصحية",
    "Healthcare Technology": "تقنية الرعاية الصحية",
    "Hear from contributors and companies who've experienced success on Mindova": "استمع من المساهمين والشركات الذين جربوا النجاح على Mindova",
    "Height": "الارتفاع",
    "Help": "مساعدة",
    "Help & Guide": "المساعدة والإرشادات",
    "Help Center": "مركز المساعدة",
    "Help Center →": "مركز المساعدة ←",
    "Help Desk": "مكتب المساعدة",
    "Help You": "نساعدك",
    "Help us identify bugs and friction points.": "ساعدنا في تحديد الأخطاء ونقاط الاحتكاك.",
    "Help?": "مساعدة؟",
    "Helpful Resources": "موارد مفيدة",
    "Hidden": "مخفي",
    "High": "عالي",
    "High-Quality Comments:": "التعليقات عالية الجودة:",
    "High-Quality Insight": "رؤية عالية الجودة",
    "High-Quality Insights": "رؤى عالية الجودة",
    "History": "السجل",
    "Home": "الرئيسية",
    "Hours": "الساعات",
    "Hours Contributed": "ساعات المساهمة",
    "Hours Worked": "ساعات العمل",
    "Hours you can contribute per week": "الساعات التي يمكنك المساهمة بها في الأسبوع",
    "How": "كيف",
    "How Can We": "كيف يمكننا",
    "How It Works": "كيف يعمل",
    "How a diverse team of contributors helped a startup build their MVP in just 6 weeks using Mindova's collaboration tools.": "كيف ساعد فريق متنوع من المساهمين شركة ناشئة في بناء MVP الخاصة بهم في 6 أسابيع فقط باستخدام أدوات التعاون في Mindova.",
    "How do I create an account?": "كيف أنشئ حساباً؟",
    "How do I find tasks?": "كيف أجد المهام؟",
    "How do I post a challenge?": "كيف أنشر تحدياً؟",
    "How does the AI matching work?": "كيف تعمل المطابقة بالذكاء الاصطناعي؟",
    "How is my reputation score calculated?": "كيف يتم حساب نقاط سمعتي؟",
    "How long does AI analysis take?": "كم من الوقت يستغرق تحليل الذكاء الاصطناعي؟",
    "How often would you like to receive email notifications?": "كم مرة تريد تلقي إشعارات البريد الإلكتروني؟",
    "How contributors are using Mindova to gain real-world experience and showcase their skills to potential employers.": "كيف يستخدم المساهمون Mindova لاكتساب خبرة واقعية وعرض مهاراتهم لأصحاب العمل المحتملين.",
    "I agree to the": "أوافق على",
    "I have read and agree to the terms of this Challenge-Specific NDA": "لقد قرأت ووافقت على شروط اتفاقية السرية الخاصة بالتحدي",
    "I have read and agree to the terms of this Non-Disclosure Agreement": "لقد قرأت ووافقت على شروط اتفاقية عدم الإفصاح هذه",
    "I want to register as": "أريد التسجيل كـ",
    "IP address:": "عنوان IP:",
    "Idea": "فكرة",
    "Idea Feedback": "ملاحظات الفكرة",
    "Idea Statistics": "إحصائيات الفكرة",
    "Idea Title": "عنوان الفكرة",
    "Idea Votes": "أصوات الفكرة",
    "Ideas": "الأفكار",
    "Ideas Submitted": "الأفكار المقدمة",
    "Identity Protection:": "حماية الهوية:",
    "If the problem persists, contact support": "إذا استمرت المشكلة، اتصل بالدعم",
    "If you believe this is an error, please contact support or check your account permissions.": "إذا كنت تعتقد أن هذا خطأ، يرجى الاتصال بالدعم أو التحقق من أذونات حسابك.",
    "Image": "صورة",
    "Images": "الصور",
    "Impact": "التأثير",
    "Import": "استيراد",
    "Important platform updates and announcements": "تحديثات وإعلانات مهمة للمنصة",
    "Improvement": "تطوير",
    "Improvements": "التطويرات",
    "In Progress": "قيد التقدم",
    "In progress right now": "قيد التقدم الآن",
    "In-App Notifications": "الإشعارات داخل التطبيق",
    "Inactive": "غير نشط",
    "Inbox": "صندوق الوارد",
    "Increase Indent": "زيادة المسافة البادئة",
    "Industry": "الصناعة",
    "Industry-standard encryption for password resets": "تشفير بمعايير الصناعة لإعادة تعيين كلمة المرور",
    "Info": "معلومات",
    "Info Message": "رسالة معلومات",
    "Innovation": "ابتكار",
    "Innovative solutions built by micro companies formed through AI-powered matching": "حلول مبتكرة بناها شركات صغيرة تشكلت من خلال المطابقة بالذكاء الاصطناعي",
    "Input": "إدخال",
    "Insert Code": "إدراج كود",
    "Insert Image": "إدراج صورة",
    "Insert Link": "إدراج رابط",
    "Insert Table": "إدراج جدول",
    "Insert Video": "إدراج فيديو",
    "Insights & Updates": "رؤى وتحديثات",
    "Insights, updates, and stories from the Mindova community": "رؤى وتحديثات وقصص من مجتمع Mindova",
    "Instant Access": "وصول فوري",
    "Integrate Mindova into your applications with our RESTful API": "دمج Mindova في تطبيقاتك مع RESTful API لدينا",
    "Intelligent Analysis": "التحليل الذكي",
    "Intermediate": "متوسط",
    "Into": "إلى",
    "Invalid": "غير صالح",
    "Invalid language selection.": "اختيار لغة غير صالح.",
    "Invalid or missing token": "رمز غير صالح أو مفقود",
    "Invitation": "دعوة",
    "Invitation Pending": "دعوة معلقة",
    "Invitations": "الدعوات",
    "Invite": "دعوة",
    "Irreversible actions require caution": "الإجراءات غير القابلة للعكس تتطلب الحذر",
    "Issue": "مشكلة",
    "Issues": "المشاكل",
    "Italic": "مائل",
    "JPG, PNG or GIF (Max 2MB)": "JPG أو PNG أو GIF (حد أقصى 2 ميجابايت)",
    "Jessica Rodriguez": "جيسيكا رودريغيز",
    "John Doe": "محمد أحمد",
    "Join": "انضم",
    "Join Discussion": "انضم للمناقشة",
    "Join Mindova to start solving challenges or finding talented contributors": "انضم إلى ميندوفا لبدء حل التحديات أو العثور على مساهمين موهوبين",
    "Join Team": "الانضمام لفريق",
    "Join Teams": "انضم إلى الفرق",
    "Join as Contributor": "انضم كمساهم",
    "Join our community and start transforming challenges into innovation": "انضم إلى مجتمعنا وابدأ في تحويل التحديات إلى ابتكار",
    "Join our community of talented contributors and innovative companies solving real-world challenges together.": "انضم إلى مجتمعنا من المساهمين الموهوبين والشركات المبتكرة التي تحل التحديات الواقعية معاً.",
    "Join the Future of": "انضم لمستقبل",
    "Join thousands of contributors and companies transforming challenges into innovation": "انضم إلى آلاف المساهمين والشركات التي تحول التحديات إلى ابتكار",
    "Just now": "الآن",
    "Justify": "ضبط",
    "KPI": "مؤشر الأداء الرئيسي",
    "KPIs": "مؤشرات الأداء الرئيسية",
    "Kanban": "كانبان",
    "Label": "تسمية",
    "Landscape": "أفقي",
    "Language": "اللغة",
    "Language changed successfully.": "تم تغيير اللغة بنجاح.",
    "Language switch failed": "فشل تغيير اللغة",
    "Last": "الأخير",
    "Last Month": "الشهر الماضي",
    "Last Name": "اسم العائلة",
    "Last Week": "الأسبوع الماضي",
    "Last Year": "العام الماضي",
    "Last updated:": "آخر تحديث:",
    "Layout": "التخطيط",
    "Layouts": "التخطيطات",
    "Leader": "القائد",
    "Leaderboard": "لوحة المتصدرين",
    "Learn More": "اعرف المزيد",
    "Learning Management System": "نظام إدارة التعلم",
    "Leave": "غادر",
    "Leave Team": "مغادرة الفريق",
    "Legal Agreement": "اتفاقية قانونية",
    "Level": "المستوى",
    "Level 1-2 challenges matched to your field - share insights and learn": "تحديات المستوى 1-2 متطابقة مع مجالك - شارك الرؤى وتعلم",
    "Level:": "المستوى:",
    "Light Mode": "الوضع الفاتح",
    "Like": "إعجاب",
    "Likes": "الإعجابات",
    "Link": "رابط",
    "Link to your code repository, demo, or deliverable": "رابط إلى مستودع الكود أو العرض التوضيحي أو التسليم الخاص بك",
    "LinkedIn": "لينكد إن",
    "LinkedIn Profile": "ملف لينكد إن",
    "List": "قائمة",
    "List All Challenges": "قائمة جميع التحديات",
    "Lists": "القوائم",
    "Live in Production": "مباشر في الإنتاج",
    "Load More": "تحميل المزيد",
    "Loading messages...": "جاري تحميل الرسائل...",
    "Loading...": "جاري التحميل...",
    "Loans Facilitated": "القروض الميسرة",
    "Login": "تسجيل الدخول",
    "Logout": "تسجيل الخروج",
    "Loss of data or content": "فقدان البيانات أو المحتوى",
    "Low": "منخفض",
    "Made Simple": "مُبسّط",
    "Made with": "صُنع بـ",
    "Maintain professional and respectful communication": "الحفاظ على تواصل مهني ومحترم",
    "Major": "رئيسي",
    "Make Impact": "أحدث تأثيراً",
    "Make an Impact with": "أحدث تأثيراً مع",
    "Make real-world impact": "أحدث تأثيراً في العالم الحقيقي",
    "Manage how and when you receive notifications": "إدارة كيفية ووقت تلقي الإشعارات",
    "Manage invitations, collaborate with teammates, and achieve together": "إدارة الدعوات، التعاون مع الزملاء، وتحقيق النجاح معًا",
    "Manage your account settings and preferences": "إدارة إعدادات حسابك وتفضيلاتك",
    "Maintenance in Progress": "الصيانة قيد التنفيذ",
    "Maintenance Mode": "وضع الصيانة",
    "Mark all as read": "تعليم الكل كمقروء",
    "Marketing": "التسويق",
    "Marketing & Tips": "التسويق والنصائح",
    "Match": "مطابقة",
    "Match Score": "نتيجة التطابق",
    "Match Talent with Opportunities": "مطابقة المواهب مع الفرص",
    "Match:": "التطابق:",
    "Matched based on your skills and experience": "مطابق بناءً على مهاراتك وخبرتك",
    "Matching Contributors...": "جاري مطابقة المساهمين...",
    "Max 5MB": "الحد الأقصى 5 ميجابايت",
    "Max Complexity:": "التعقيد الأقصى:",
    "Maximize": "تكبير",
    "Maximum 255 characters": "255 حرفًا كحد أقصى",
    "Meaning": "المعنى",
    "Medium": "متوسط",
    "Member": "عضو",
    "Member Since": "عضو منذ",
    "Members": "الأعضاء",
    "Menu": "قائمة",
    "Menus": "القوائم",
    "Message": "رسالة",
    "Messages": "الرسائل",
    "Metric": "مقياس",
    "Metrics": "المقاييس",
    "Michael Chen": "مايكل تشين",
    "Micro Companies": "الشركات الصغيرة",
    "Milestone": "معلم رئيسي",
    "Milestones": "المعالم الرئيسية",
    "Mindova": "ميندوفا",
    "Mindova gave me the opportunity to work on real-world projects and build my portfolio while making a positive impact. The AI matching connected me with teams where I could contribute meaningfully and learn from experienced developers.": "منحني Mindova فرصة العمل على مشاريع واقعية وبناء مجموعة أعمالي أثناء إحداث تأثير إيجابي. ربطتني المطابقة بالذكاء الاصطناعي بفرق حيث يمكنني المساهمة بشكل هادف والتعلم من المطورين ذوي الخبرة.",
    "Mindova is an AI-powered collaboration platform that connects contributors with companies to solve real-world challenges. The Platform provides:": "Mindova هي منصة تعاون مدعومة بالذكاء الاصطناعي تربط المساهمين بالشركات لحل التحديات الواقعية. توفر المنصة:",
    "Mindova is an AI-powered collaboration platform that transforms how organizations solve complex challenges": "ميندوفا هي منصة تعاون مدعومة بالذكاء الاصطناعي تحول الطريقة التي تحل بها المنظمات التحديات المعقدة",
    "Mindova is provided \"as is\" without warranties of any kind. We are not liable for:": "يتم توفير Mindova \"كما هي\" بدون ضمانات من أي نوع. نحن غير مسؤولين عن:",
    "Mindova Administrator?": "مسؤول ميندوفا؟",
    "Minimize": "تصغير",
    "Minimum 100 characters, maximum 2000 characters": "100 حرف كحد أدنى، 2000 حرف كحد أقصى",
    "Minimum 100 characters, maximum 5000 characters": "100 حرف كحد أدنى، 5000 حرف كحد أقصى",
    "Minimum 8 characters": "8 أحرف كحد أدنى",
    "Minor": "ثانوي",
    "Missing Requirements:": "المتطلبات المفقودة:",
    "Missing Skills": "المهارات المفقودة",
    "Moderate": "معتدل",
    "Moderator": "مشرف",
    "Monitor Progress": "راقب التقدم",
    "Monitor tasks, achievements, and team collaboration in real-time with advanced analytics": "راقب المهام والإنجازات والتعاون الجماعي في الوقت الفعلي بتحليلات متقدمة",
    "Most Active Companies": "الشركات الأكثر نشاطًا",
    "Move to": "نقل إلى",
    "Mute": "كتم الصوت",
    "My": "خاصتي",
    "My Active Tasks": "مهامي النشطة",
    "My Challenges": "تحدياتي",
    "My Profile": "ملفي الشخصي",
    "My Task Invitations & Progress": "دعوات مهامي وتقدمي",
    "My Tasks": "مهامي",
    "My Teams": "فرقي",
    "Name": "الاسم",
    "Navigate to \"Challenges\" → \"Create Challenge\" from your dashboard. Provide a detailed description (minimum 100 characters) of your problem, expected outcomes, and optional deadlines. Our AI will then analyze and decompose it into manageable tasks.": "انتقل إلى \"التحديات\" ← \"إنشاء تحدي\" من لوحة التحكم الخاصة بك. قدم وصفاً تفصيلياً (100 حرف كحد أدنى) لمشكلتك والنتائج المتوقعة والمواعيد النهائية الاختيارية. سيقوم الذكاء الاصطناعي لدينا بعد ذلك بتحليله وتقسيمه إلى مهام قابلة للإدارة.",
    "Need Help?": "تحتاج مساعدة؟",
    "Need Immediate Assistance?": "تحتاج مساعدة فورية؟",
    "Need at least": "تحتاج على الأقل",
    "Need help?": "تحتاج مساعدة؟",
    "Network with professionals": "تواصل مع المحترفين",
    "New": "جديد",
    "New Challenge": "تحدي جديد",
    "New Challenge Submission": "تقديم تحدي جديد",
    "New Ideas": "أفكار جديدة",
    "New Password": "كلمة المرور الجديدة",
    "New Task Assignments": "تكليفات مهام جديدة",
    "Next": "التالي",
    "Next Step: NDA Signature Required": "الخطوة التالية: التوقيع على اتفاقية السرية مطلوب",
    "No": "لا",
    "No Challenges Found": "لم يتم العثور على تحديات",
    "No Challenges Yet": "لا توجد تحديات بعد",
    "No Community Challenges Yet": "لا توجد تحديات مجتمعية بعد",
    "No Rankings Yet": "لا توجد تصنيفات بعد",
    "No Teams Yet": "لا توجد فرق بعد",
    "No accepted assignments": "لا توجد تكليفات مقبولة",
    "No available tasks matching your profile at the moment.": "لا توجد مهام متاحة تطابق ملفك الشخصي في الوقت الحالي.",
    "No comments yet. Be the first to share your insights!": "لا توجد تعليقات بعد. كن أول من يشارك رؤاه!",
    "No completed tasks yet": "لا توجد مهام مكتملة بعد",
    "No content": "لا يوجد محتوى",
    "No contributors yet": "لا يوجد مساهمون بعد",
    "No data available": "لا توجد بيانات متاحة",
    "No declined tasks": "لا توجد مهام مرفوضة",
    "No feedback available": "لا توجد ملاحظات متاحة",
    "No ideas submitted yet": "لم تقدم أفكار بعد",
    "No items": "لا توجد عناصر",
    "No matching records found": "لم يتم العثور على سجلات مطابقة",
    "No messages yet": "لا توجد رسائل بعد",
    "No notifications": "لا توجد إشعارات",
    "No pending assignments": "لا توجد تكليفات معلقة",
    "No pending invitations": "لا توجد دعوات معلقة",
    "No results found": "لم يتم العثور على نتائج",
    "No skills extracted yet. Upload or update your CV for analysis.": "لم يتم استخراج مهارات بعد. قم بتحميل أو تحديث سيرتك الذاتية للتحليل.",
    "No spam. Unsubscribe anytime.": "لا رسائل غير مرغوب فيها. إلغاء الاشتراك في أي وقت.",
    "No tasks in progress": "لا توجد مهام قيد التنفيذ",
    "Non-Disclosure": "عدم الإفصاح",
    "None": "لا شيء",
    "Normal": "عادي",
    "Not Found - Resource does not exist": "غير موجود - المورد غير موجود",
    "Not Started": "لم يبدأ",
    "Not analyzed": "لم يتم التحليل",
    "Not connected": "غير متصل",
    "Not engage in spam, harassment, or malicious activities": "عدم الانخراط في البريد العشوائي أو المضايقة أو الأنشطة الضارة",
    "Not misuse or attempt to manipulate the AI matching system": "عدم إساءة استخدام أو محاولة التلاعب بنظام المطابقة بالذكاء الاصطناعي",
    "Not request illegal or unethical work": "عدم طلب عمل غير قانوني أو غير أخلاقي",
    "Not set": "لم يتم التعيين",
    "Not started": "لم يبدأ",
    "Note:": "ملاحظة:",
    "Notification Settings": "إعدادات الإشعارات",
    "Notifications": "الإشعارات",
    "Email and notification preferences": "تفضيلات البريد الإلكتروني والإشعارات",
    "Email Notifications": "إشعارات البريد الإلكتروني",
    "In-App Notifications": "الإشعارات داخل التطبيق",
    "Admin Notification Email": "بريد إشعارات المسؤول",
    "New User Notifications": "إشعارات المستخدم الجديد",
    "New Challenge Notifications": "إشعارات التحديات الجديدة",
    "New Company Notifications": "إشعارات الشركات الجديدة",
    "Number": "رقم",
    "OK - Request successful": "موافق - الطلب ناجح",
    "Objective": "هدف",
    "Objectives": "الأهداف",
    "Obtaining a Token": "الحصول على رمز",
    "Offline": "غير متصل",
    "Once you complete your profile and upload your CV, our AI automatically matches you to suitable tasks. You'll receive notifications when invited to teams or assigned tasks. Check your dashboard regularly for new opportunities that match your skills.": "بمجرد إكمال ملفك الشخصي وتحميل سيرتك الذاتية، يطابقك الذكاء الاصطناعي لدينا تلقائياً مع المهام المناسبة. ستتلقى إشعارات عند دعوتك إلى فرق أو تعيين مهام. تحقق من لوحة التحكم الخاصة بك بانتظام للحصول على فرص جديدة تتوافق مع مهاراتك.",
    "One-time secure token ensures only you can reset": "رمز آمن لمرة واحدة يضمن أنك الوحيد الذي يمكنه إعادة التعيين",
    "Online": "متصل",
    "Open": "مفتوح",
    "Optimal team formation": "تشكيل الفريق الأمثل",
    "Optional": "اختياري",
    "Options": "الخيارات",
    "Or continue with": "أو تابع بواسطة",
    "Ordered List": "قائمة مرتبة",
    "Orientation": "الاتجاه",
    "Other": "أخرى",
    "Our AI analyzes your CV using GPT-4o to extract skills, experience levels, and expertise areas. It then matches you to tasks based on skill alignment, experience requirements, and availability. Match scores of 60% or higher are recommended for optimal collaboration.": "يحلل الذكاء الاصطناعي لدينا سيرتك الذاتية باستخدام GPT-4o لاستخراج المهارات ومستويات الخبرة ومجالات الخبرة. ثم يطابقك مع المهام بناءً على توافق المهارات ومتطلبات الخبرة والتوفر. يوصى بنقاط مطابقة 60% أو أعلى للتعاون الأمثل.",
    "Our AI-powered platform connects talented contributors with meaningful challenges, creating optimal teams to solve real-world problems.": "تربط منصتنا المدعومة بالذكاء الاصطناعي المساهمين الموهوبين بتحديات هادفة، وتنشئ فرقاً مثالية لحل مشاكل العالم الحقيقي.",
    "Our Mission": "مهمتنا",
    "Our Platform uses AI technology to analyze challenges, match contributors, and form teams. While we strive for accuracy, AI-generated recommendations are not guaranteed to be perfect. Users should exercise their own judgment when accepting matches and assignments.": "تستخدم منصتنا تقنية الذكاء الاصطناعي لتحليل التحديات ومطابقة المساهمين وتشكيل الفرق. بينما نسعى للدقة، التوصيات التي ينشئها الذكاء الاصطناعي ليست مضمونة لتكون مثالية. يجب على المستخدمين ممارسة حكمهم الخاص عند قبول المطابقات والتكليفات.",
    "Our Technology": "تقنيتنا",
    "Our community is built on collaboration, respect, and the shared goal of solving meaningful challenges. These guidelines help ensure a positive experience for everyone.": "مجتمعنا مبني على التعاون والاحترام والهدف المشترك لحل التحديات الهادفة. تساعد هذه الإرشادات في ضمان تجربة إيجابية للجميع.",
    "Our cutting-edge technology ensures optimal matching and team performance": "تضمن تقنيتنا المتطورة المطابقة المثلى وأداء الفريق",
    "Our intelligent system analyzes skills, experience, and availability to create perfect team matches for every challenge.": "نظامنا الذكي يحلل المهارات والخبرة والتوافر لإنشاء فرق مثالية لكل تحدٍ.",
    "Outbox": "صندوق الصادر",
    "Output": "إخراج",
    "Overall Coverage": "التغطية الإجمالية",
    "Overall Feedback": "الملاحظات الإجمالية",
    "Overview": "نظرة عامة",
    "Owner": "المالك",
    "Ownership of work product created through the Platform should be agreed upon between companies and contributors. We recommend establishing clear IP agreements before commencing work.": "يجب الاتفاق على ملكية منتج العمل الذي تم إنشاؤه من خلال المنصة بين الشركات والمساهمين. نوصي بوضع اتفاقيات ملكية فكرية واضحة قبل بدء العمل.",
    "Page": "الصفحة",
    "Page Not Found": "الصفحة غير موجودة",
    "Page number for pagination": "رقم الصفحة للترقيم",
    "Paragraph": "فقرة",
    "Part of Challenge": "جزء من التحدي",
    "Participation Rate": "معدل المشاركة",
    "Password": "كلمة المرور",
    "Password Recovery": "استرجاع كلمة المرور",
    "Paste": "لصق",
    "Patient Management System for Rural Clinics": "نظام إدارة المرضى للعيادات الريفية",
    "Patients Served": "المرضى المخدومون",
    "Pause": "إيقاف مؤقت",
    "Pending": "قيد الانتظار",
    "Pending Invitations": "الدعوات المعلقة",
    "Performance Metrics": "مقاييس الأداء",
    "Performance Score": "نتيجة الأداء",
    "Permanently Delete": "حذف نهائياً",
    "Permanently delete your account and all associated data. This action cannot be undone.": "حذف حسابك وجميع البيانات المرتبطة به نهائيًا. لا يمكن التراجع عن هذا الإجراء.",
    "Permission": "الصلاحية",
    "Permissions": "الصلاحيات",
    "Personal Information": "المعلومات الشخصية",
    "Phone": "الهاتف",
    "Phone Number": "رقم الهاتف",
    "Photo": "صورة",
    "Photos": "الصور",
    "Placeholder": "نائب",
    "Platform": "المنصة",
    "Play": "تشغيل",
    "Play a sound when you receive a notification": "تشغيل صوت عند تلقي إشعار",
    "Play sound": "تشغيل الصوت",
    "Please enter your full legal name.": "يرجى إدخال اسمك القانوني الكامل.",
    "Please read and agree to the NDA terms before proceeding.": "يرجى قراءة الموافقة على شروط اتفاقية السرية قبل المتابعة.",
    "Please read and sign the general NDA to continue using the platform": "يرجى قراءة وتوقيع اتفاقية السرية العامة لمواصلة استخدام المنصة",
    "Please sign in to join the discussion": "يرجى تسجيل الدخول للانضمام إلى المناقشة",
    "Points": "النقاط",
    "Popular": "الأكثر شعبية",
    "Portfolio": "المعرض",
    "Portfolio-building projects": "مشاريع بناء المحفظة",
    "Portrait": "عمودي",
    "Post": "منشور",
    "Post Challenge": "انشر تحدياً",
    "Post Comment": "نشر تعليق",
    "Post Your Challenge": "انشر تحديك",
    "Post a Challenge": "انشر تحدياً",
    "Post challenges to solve": "نشر تحديات لحلها",
    "Posted by": "نُشر بواسطة",
    "Posts": "المنشورات",
    "Powered by": "مدعوم بواسطة",
    "Powered by AI, driven by human potential": "مدعومة بالذكاء الاصطناعي، مُوجّهة بالإمكانات البشرية",
    "Powered by GPT-4o and advanced algorithms for intelligent collaboration": "مدعوم بـ GPT-4o وخوارزميات متقدمة للتعاون الذكي",
    "Preferences": "التفضيلات",
    "Preformatted": "منسق مسبقاً",
    "Previous": "السابق",
    "Print": "طباعة",
    "Priority": "الأولوية",
    "Privacy": "الخصوصية",
    "Privacy & Legal": "الخصوصية والقانون",
    "Privacy Policy": "سياسة الخصوصية",
    "Private": "خاص",
    "Processing": "جاري المعالجة",
    "Product Update: New Features in 2025": "تحديث المنتج: ميزات جديدة في 2025",
    "Product Updates": "تحديثات المنتج",
    "Professional Information": "المعلومات المهنية",
    "Professional profile based on CV analysis": "ملف مهني بناءً على تحليل السيرة الذاتية",
    "Profile": "الملف الشخصي",
    "Profile Picture": "صورة الملف الشخصي",
    "Profile Picture (Optional)": "صورة الملف الشخصي (اختياري)",
    "Profile Settings": "إعدادات الملف الشخصي",
    "Profile Setup": "إعداد الملف الشخصي",
    "Progress": "التقدم",
    "Progress Tracking": "تتبع التقدم",
    "Progress tracking & analytics": "تتبع التقدم والتحليلات",
    "Progress tracking and analytics": "تتبع التقدم والتحليلات",
    "Proposal": "مقترح",
    "Proposals": "المقترحات",
    "Proven Results": "نتائج مثبتة",
    "Provide accurate and truthful information": "تقديم معلومات دقيقة وصادقة",
    "Provide clear and accurate challenge descriptions": "تقديم أوصاف تحدي واضحة ودقيقة",
    "Provide timely feedback and communication": "تقديم ملاحظات وتواصل في الوقت المناسب",
    "Public": "عام",
    "Published": "منشور",
    "Push Notifications": "الإشعارات الفورية",
    "Quality": "الجودة",
    "Quality Ratings": "تقييمات الجودة",
    "Quality of work delivered through the Platform": "جودة العمل المقدم من خلال المنصة",
    "Queries": "الاستفسارات",
    "Query": "استفسار",
    "Query Parameters": "معاملات الاستعلام",
    "Question": "سؤال",
    "Questions": "الأسئلة",
    "Quick Links": "روابط سريعة",
    "Quick Recovery": "استرجاع سريع",
    "Quote": "اقتباس",
    "Radio": "زر اختيار",
    "Range": "نطاق",
    "Rank": "الترتيب",
    "Rate Limits": "حدود المعدل",
    "Rate limit information is included in response headers:": "معلومات حد المعدل مضمنة في رؤوس الاستجابة:",
    "Rating": "التقييم",
    "Ratings": "التقييمات",
    "Read": "قراءة",
    "Read more": "اقرأ المزيد",
    "Ready to Create Your Success Story?": "هل أنت مستعد لإنشاء قصة نجاحك؟",
    "Ready to Get Started?": "هل أنت مستعد للبدء؟",
    "Ready to Join Our Community?": "هل أنت مستعد للانضمام إلى مجتمعنا؟",
    "Ready to Make a Difference?": "مستعد لإحداث فرق؟",
    "Ready to Make an Impact?": "هل أنت مستعد لإحداث تأثير؟",
    "Real challenges solved by talented contributors through Mindova's AI-powered platform": "تحديات حقيقية حلها مساهمون موهوبون من خلال منصة Mindova المدعومة بالذكاء الاصطناعي",
    "Real-time": "الوقت الفعلي",
    "Real-time analytics and performance monitoring with comprehensive dashboards": "تحليلات الوقت الفعلي ومراقبة الأداء مع لوحات معلومات شاملة",
    "Reason for declining:": "سبب الرفض:",
    "Receive": "استقبال",
    "Receive a daily summary of all notifications": "تلقي ملخص يومي لجميع الإشعارات",
    "Receive a weekly summary of all notifications": "تلقي ملخص أسبوعي لجميع الإشعارات",
    "Receive completed work, review deliverables, and solve your challenge.": "تلقى العمل المكتمل، وراجع النتائج، وحل التحدي الخاص بك.",
    "Receive reset link instantly in your inbox": "استلم رابط إعادة التعيين فورًا في بريدك الوارد",
    "Receive weekly summaries of your challenge progress": "تلقي ملخصات أسبوعية لتقدم تحديك",
    "Received": "تم الاستقبال",
    "Recent": "الأخيرة",
    "Recent Success Stories": "قصص نجاح حديثة",
    "Recommended": "الموصى بها",
    "Record": "تسجيل",
    "Redo": "إعادة",
    "Refresh": "تحديث",
    "Refresh the page and try again": "حدّث الصفحة وحاول مرة أخرى",
    "Register": "إنشاء حساب",
    "Registration is disabled during maintenance mode.": "التسجيل معطل أثناء وضع الصيانة.",
    "Reject": "رفض",
    "Release": "إصدار",
    "Releases": "الإصدارات",
    "Remember Me": "تذكرني",
    "Remember me": "تذكرني",
    "Remember your password?": "تتذكر كلمة المرور؟",
    "Reminder": "تذكير",
    "Reminders": "التذكيرات",
    "Remove vote": "إزالة التصويت",
    "Rename": "إعادة تسمية",
    "Replies": "الردود",
    "Reply": "رد",
    "Report": "تقرير",
    "Report an Issue": "الإبلاغ عن مشكلة",
    "Reports": "التقارير",
    "Reputation": "السمعة",
    "Reputation Level": "مستوى السمعة",
    "Reputation Milestones": "معالم السمعة",
    "Reputation Score": "نتيجة السمعة",
    "Reputation and portfolio building for contributors": "بناء السمعة والمحفظة للمساهمين",
    "Reputation system": "نظام السمعة",
    "Reputation:": "السمعة:",
    "Request": "طلب",
    "Request Body": "نص الطلب",
    "Requests": "الطلبات",
    "Required": "مطلوب",
    "Required Experience": "الخبرة المطلوبة",
    "Required Skills": "المهارات المطلوبة",
    "Reset": "إعادة تعيين",
    "Reset Password": "إعادة تعيين كلمة المرور",
    "Resize": "تغيير الحجم",
    "Resolution": "الدقة",
    "Resources": "الموارد",
    "Respect confidentiality of challenge information": "احترام سرية معلومات التحدي",
    "Respect intellectual property rights": "احترام حقوق الملكية الفكرية",
    "Respect contributor contributions and efforts": "احترام مساهمات وجهود المساهمين",
    "Response": "الاستجابة",
    "Restore": "استعادة",
    "Results per page": "النتائج لكل صفحة",
    "Resume": "السيرة الذاتية",
    "Retrieves the authenticated contributor's profile information including skills and statistics.": "يسترجع معلومات ملف المساهم المصادق عليه بما في ذلك المهارات والإحصائيات.",
    "Returns a paginated list of all challenges.": "يعيد قائمة مرقمة لجميع التحديات.",
    "Returns all task assignments for the authenticated contributor.": "يعيد جميع تكليفات المهام للمساهم المصادق عليه.",
    "Returns detailed information about a specific challenge including workstreams, tasks, and teams.": "يعيد معلومات مفصلة حول تحدي محدد بما في ذلك مسارات العمل والمهام والفرق.",
    "Returns detailed information about a team including all members and their roles.": "يعيد معلومات مفصلة حول فريق بما في ذلك جميع الأعضاء وأدوارهم.",
    "Returns tasks matched to the authenticated contributor based on their skills.": "يعيد المهام المطابقة للمساهم المصادق عليه بناءً على مهاراته.",
    "Review": "مراجعة",
    "Review Submission": "مراجعة التقديم",
    "Review and manage contributor deliverables": "مراجعة وإدارة مخرجات المساهمين",
    "Review the team details, your assigned role, and responsibilities in your notifications. You can accept to join or decline if it's not a good fit. There are no penalties for declining invitations - we want you to work on projects that excite you!": "راجع تفاصيل الفريق ودورك المخصص والمسؤوليات في إشعاراتك. يمكنك القبول للانضمام أو الرفض إذا لم تكن مناسبة. لا توجد عقوبات لرفض الدعوات - نريدك أن تعمل على مشاريع تثير حماسك!",
    "Reviews": "المراجعات",
    "Role": "الدور",
    "Roles": "الأدوار",
    "Rotate": "تدوير",
    "Row": "صف",
    "Rows": "الصفوف",
    "SMS Notifications": "إشعارات الرسائل القصيرة",
    "Sarah M.": "سارة م.",
    "Saturation": "التشبع",
    "Save": "حفظ",
    "Save Changes": "حفظ التغييرات",
    "Save Preferences": "حفظ التفضيلات",
    "Saving...": "جاري الحفظ...",
    "Schedule": "الجدول",
    "Score": "النتيجة",
    "Score:": "النتيجة:",
    "Scores": "النتائج",
    "Screenshot (Optional)": "لقطة شاشة (اختياري)",
    "Search": "بحث",
    "Secure & Private": "آمنة وخاصة",
    "Secure & Trusted": "آمنة وموثوقة",
    "Secure Password": "كلمة مرور آمنة",
    "Secure Process": "عملية آمنة",
    "Secure Reset": "إعادة تعيين آمنة",
    "Security": "الأمان",
    "Security and authentication settings": "إعدادات الأمان والمصادقة",
    "Session Lifetime (Minutes)": "مدة الجلسة (بالدقائق)",
    "Force HTTPS": "فرض HTTPS",
    "Minimum Password Length": "الحد الأدنى لطول كلمة المرور",
    "General NDA Required": "اتفاقية السرية العامة مطلوبة",
    "Challenge NDA Required": "اتفاقية سرية التحدي مطلوبة",
    "Select": "اختر",
    "Select All": "تحديد الكل",
    "Select type...": "اختر النوع...",
    "Select your field...": "اختر مجالك...",
    "Select your language": "اختر لغتك",
    "Select your role": "اختر دورك",
    "Selected": "محدد",
    "Send": "إرسال",
    "Send Message": "إرسال رسالة",
    "Send Reset Link": "إرسال رابط إعادة التعيين",
    "Send us a Message": "أرسل لنا رسالة",
    "Sending...": "جاري الإرسال...",
    "Sent": "تم الإرسال",
    "Sent Items": "العناصر المُرسلة",
    "Server Error": "خطأ في الخادم",
    "Server Error - Something went wrong": "خطأ في الخادم - حدث خطأ ما",
    "Service interruptions or technical issues": "انقطاعات الخدمة أو المشاكل التقنية",
    "Set realistic expectations and deadlines": "تعيين توقعات ومواعيد نهائية واقعية",
    "Settings": "الإعدادات",
    "Share": "مشاركة",
    "Share Idea": "مشاركة فكرة",
    "Share Your Insights": "شارك رؤاك",
    "Share your innovation challenge with our community of talented contributors": "شارك تحدي الابتكار الخاص بك مع مجتمعنا من المساهمين الموهوبين",
    "Share your thoughts, suggestions, or ask clarifying questions about this challenge...": "شارك أفكارك أو اقتراحاتك أو اطرح أسئلة توضيحية حول هذا التحدي...",
    "Show Less": "عرض أقل",
    "Show More": "عرض المزيد",
    "Show notifications in the platform interface": "عرض الإشعارات في واجهة المنصة",
    "Showing": "عرض",
    "Showing :from to :to of :total results": "عرض :from إلى :to من :total نتيجة",
    "Sign Challenge NDA": "التوقيع على اتفاقية السرية للتحدي",
    "Sign General NDA": "التوقيع على اتفاقية السرية العامة",
    "Sign In": "تسجيل الدخول",
    "Sign NDA & Continue": "التوقيع على اتفاقية السرية والمتابعة",
    "Sign NDA & View Challenge": "التوقيع على اتفاقية السرية وعرض التحدي",
    "Sign Up": "سجل",
    "Sign in": "تسجيل الدخول",
    "Sign in to continue your innovation journey": "سجل الدخول لمواصلة رحلة الابتكار الخاصة بك",
    "Sign in with LinkedIn": "تسجيل الدخول بواسطة لينكد إن",
    "Sign the NDA to access full challenge details": "وقع على اتفاقية السرية للوصول إلى تفاصيل التحدي الكاملة",
    "Sign up for free": "سجل مجانًا",
    "Simple": "بسيط",
    "Simple challenges → community discussion, Complex → task decomposition": "تحديات بسيطة ← مناقشة المجتمع، معقدة ← تقسيم المهام",
    "Simple, powerful, effective": "بسيطة، قوية، فعّالة",
    "Size": "الحجم",
    "Skill": "مهارة",
    "Skill-matched contributors": "مساهمون متطابقون في المهارات",
    "Skills": "المهارات",
    "Skills & Expertise": "المهارات والخبرات",
    "Skills Coverage": "تغطية المهارات",
    "Slider": "شريط منزلق",
    "Smart Matching": "المطابقة الذكية",
    "Smart Routing:": "التوجيه الذكي:",
    "Solution": "حل",
    "Solution Description": "وصف الحل",
    "Solution Submitted - Under Review": "تم تقديم الحل - قيد المراجعة",
    "Solution submitted": "تم تقديم الحل",
    "Solutions": "الحلول",
    "Solve Complex Challenges with": "حل التحديات المعقدة مع",
    "Solve real challenges, build your reputation, and create portfolio-worthy projects.": "حل التحديات الحقيقية، وابنِ سمعتك، وأنشئ مشاريع جديرة بالمحفظة.",
    "Something didn't work": "شيء ما لم يعمل",
    "Something went wrong on our end.": "حدث خطأ ما من جانبنا.",
    "Spam": "البريد المزعج",
    "Specialist": "متخصص",
    "Speed": "السرعة",
    "Square": "مربع",
    "Start": "ابدأ",
    "Start Date": "تاريخ البدء",
    "Start Task": "بدء المهمة",
    "Start Working": "ابدأ العمل",
    "Start collaborating on real-world projects and build your portfolio with Mindova.": "ابدأ التعاون في مشاريع واقعية وابنِ مجموعة أعمالك مع Mindova.",
    "Start the conversation with your team!": "ابدأ المحادثة مع فريقك!",
    "Start your innovation journey by submitting your first challenge to the community.": "ابدأ رحلة الابتكار الخاصة بك من خلال تقديم تحديك الأول إلى المجتمع.",
    "Statistics": "الإحصائيات",
    "Status": "الحالة",
    "Status:": "الحالة:",
    "Stay": "ابق",
    "Still Have Questions?": "لا تزال لديك أسئلة؟",
    "Stop": "إيقاف",
    "Stories": "قصص",
    "Strengths:": "نقاط القوة:",
    "Strong Encryption": "تشفير قوي",
    "Style": "النمط",
    "Styles": "الأنماط",
    "Subject": "الموضوع",
    "Submission Deadline": "الموعد النهائي للتقديم",
    "Submit": "إرسال",
    "Submit Challenge": "قدّم التحدي",
    "Submit Idea": "إرسال فكرة",
    "Submit Improved Solution": "إرسال حل محسّن",
    "Submit New Challenge": "تقديم تحدي جديد",
    "Submit Solution": "إرسال الحل",
    "Submit Your First Challenge": "قدم تحديك الأول",
    "Submit Your Idea": "قدم فكرتك",
    "Submit Your Solution": "قدم حلك",
    "Submit a": "تقديم",
    "Submit your challenge with detailed description of the problem you want to solve.": "قدم تحديك مع وصف تفصيلي للمشكلة التي تريد حلها.",
    "Submitted": "مُقدّم",
    "Subscribe": "اشترك",
    "Subscribe to our newsletter to receive the latest blog posts, platform updates, and community highlights directly in your inbox.": "اشترك في نشرتنا الإخبارية لتلقي أحدث منشورات المدونة وتحديثات المنصة وأبرز أحداث المجتمع مباشرة في صندوق الوارد الخاص بك.",
    "Subscriber": "مشترك",
    "Subscribers": "المشتركون",
    "Subtitles": "الترجمة",
    "Success": "نجح",
    "Success Criteria": "معايير النجاح",
    "Success Message": "رسالة نجاح",
    "Success Rate": "معدل النجاح",
    "Success Stories": "قصص النجاح",
    "Success Story: Building an E-commerce Platform": "قصة نجاح: بناء منصة تجارة إلكترونية",
    "Successfully finished": "اكتمل بنجاح",
    "Summary": "ملخص",
    "Support": "الدعم",
    "Supported formats: PDF, DOC, DOCX (Max 10MB)": "التنسيقات المدعومة: PDF و DOC و DOCX (حد أقصى 10 ميجابايت)",
    "Supporting 800+ Borrowers": "دعم أكثر من 800 مقترض",
    "Switch": "مفتاح",
    "System Updates": "تحديثات النظام",
    "System evaluates challenge complexity (simple vs complex)": "يقيّم النظام تعقيد التحدي (بسيط مقابل معقد)",
    "Table": "جدول",
    "Tables": "الجداول",
    "Tag": "وسم",
    "Tags": "الوسوم",
    "Target": "الهدف",
    "Targets": "الأهداف",
    "Task": "مهمة",
    "Task Assignments": "تكليفات المهام",
    "Task Completion": "إنجاز المهمة",
    "Task Completions": "إنجازات المهام",
    "Task Decomposition (Pending)": "تقسيم المهام (قيد الانتظار)",
    "Task Description": "وصف المهمة",
    "Task Details": "تفاصيل المهمة",
    "Task Info": "معلومات المهمة",
    "Task Management": "إدارة المهام",
    "Task Progress by Workstream": "تقدم المهمة حسب سير العمل",
    "Task Status Distribution": "توزيع حالة المهمة",
    "Task Updates": "تحديثات المهمة",
    "Tasks": "المهام",
    "Tasks Completed": "المهام المكتملة",
    "Tasks Done": "المهام المنجزة",
    "Tasks in Progress": "المهام قيد التنفيذ",
    "Team": "فريق",
    "Team Chat": "محادثة الفريق",
    "Team Collaboration": "تعاون الفريق",
    "Team Execution": "تنفيذ الفريق",
    "Team Formation": "تشكيل الفرق",
    "Team Invitations": "دعوات الفريق",
    "Team Leader": "قائد الفريق",
    "Team Leader View:": "عرض قائد الفريق:",
    "Team Match": "مطابقة الفريق",
    "Team Members": "أعضاء الفريق",
    "Team Objectives": "أهداف الفريق",
    "Team Size": "حجم الفريق",
    "Team Size:": "حجم الفريق:",
    "Team collaboration experience": "تجربة تعاون الفريق",
    "Team formation and collaboration features": "ميزات تشكيل الفريق والتعاون",
    "Teams": "الفرق",
    "Teams & Collaboration": "الفرق والتعاون",
    "Teams collaborate and deliver high-quality solutions": "تتعاون الفرق وتُقدّم حلولاً عالية الجودة",
    "TechStartup Inc.": "TechStartup Inc.",
    "Technical Deep Dive: CV Analysis": "تعمق تقني: تحليل السيرة الذاتية",
    "Technical Support": "الدعم الفني",
    "Technology": "التكنولوجيا",
    "Tell us about your company and your mission...": "أخبرنا عن شركتك ومهمتك...",
    "Tell us about your experience, interests, and what motivates you...": "أخبرنا عن خبرتك واهتماماتك وما يحفزك...",
    "Tell us about yourself to get started on your innovation journey": "أخبرنا عن نفسك لبدء رحلة الابتكار الخاصة بك",
    "Tell us about yourself...": "أخبرنا عن نفسك...",
    "Tell us how we can help...": "أخبرنا كيف يمكننا المساعدة...",
    "Template": "قالب",
    "Templates": "القوالب",
    "Terms": "الشروط",
    "Terms and Conditions": "الشروط والأحكام",
    "Terms of Service": "شروط الخدمة",
    "Text": "نص",
    "Text Color": "لون النص",
    "Textarea": "منطقة نصية",
    "Thank you for your report. This helps us improve the platform.": "شكراً لتقريرك. هذا يساعدنا على تحسين المنصة.",
    "The API uses standard HTTP status codes:": "يستخدم API رموز حالة HTTP القياسية:",
    "The Mindova API allows developers to programmatically interact with challenges, contributors, tasks, and teams. All API endpoints require authentication using Laravel Sanctum tokens.": "يسمح Mindova API للمطورين بالتفاعل برمجياً مع التحديات والمساهمين والمهام والفرق. تتطلب جميع نقاط نهاية API المصادقة باستخدام رموز Laravel Sanctum.",
    "The Platform offers two types of accounts:": "تقدم المنصة نوعين من الحسابات:",
    "The platform is currently under maintenance. Only administrators can access at this time.": "المنصة حالياً تحت الصيانة. يمكن للمسؤولين فقط الوصول في هذا الوقت.",
    "The healthcare team delivered a Progressive Web App with offline sync, appointment scheduling, medical records management, and prescription tracking. The solution is now deployed in 15 clinics serving over 50,000 patients.": "قدم فريق الرعاية الصحية تطبيق ويب تقدمي مع مزامنة دون اتصال، وجدولة المواعيد، وإدارة السجلات الطبية، وتتبع الوصفات الطبية. الحل الآن منتشر في 15 عيادة تخدم أكثر من 50,000 مريض.",
    "The page you requested could not be found. It might have been moved, deleted, or never existed in the first place.": "لا يمكن العثور على الصفحة المطلوبة. ربما تم نقلها أو حذفها أو لم تكن موجودة في الأصل.",
    "The selected language is not supported.": "اللغة المختارة غير مدعومة.",
    "The team delivered a Progressive Web App with offline sync, appointment scheduling, medical records management, and prescription tracking. The solution is now deployed in 15 clinics serving over 50,000 patients.": "قدم الفريق تطبيق ويب تقدمي مع مزامنة دون اتصال، وجدولة المواعيد، وإدارة السجلات الطبية، وتتبع الوصفات الطبية. الحل الآن منتشر في 15 عيادة تخدم أكثر من 50,000 مريض.",
    "The contributors who worked on our carbon tracking app were passionate, skilled, and committed. Mindova's platform made it easy to manage the project and communicate with the team. The app is now helping thousands reduce their environmental impact.": "كان المساهمون الذين عملوا على تطبيق تتبع الكربون لدينا متحمسين وماهرين وملتزمين. جعلت منصة Mindova من السهل إدارة المشروع والتواصل مع الفريق. التطبيق الآن يساعد الآلاف على تقليل تأثيرهم البيئي.",
    "Theme": "السمة",
    "These level 1-2 challenges are great for learning and skill development. High-quality comments (scored 7+ by AI) boost your reputation and get noticed by challenge owners.": "تحديات المستوى 1-2 هذه رائعة للتعلم وتطوير المهارات. التعليقات عالية الجودة (التي حصلت على 7+ من الذكاء الاصطناعي) تعزز سمعتك وتلفت انتباه أصحاب التحديات.",
    "These level 1-2 challenges are perfect for learning and skill development.": "تحديات المستوى 1-2 هذه مثالية للتعلم وتطوير المهارات.",
    "These requirements were analyzed by AI to help you understand exactly what's needed and how to succeed.": "تم تحليل هذه المتطلبات بواسطة الذكاء الاصطناعي لمساعدتك على فهم ما هو مطلوب بالضبط وكيفية النجاح.",
    "This Month": "هذا الشهر",
    "This Week": "هذا الأسبوع",
    "This Year": "هذا العام",
    "This action cannot be undone": "لا يمكن التراجع عن هذا الإجراء",
    "This action is unauthorized. You may not have the required permissions or your account type may not support this feature.": "هذا الإجراء غير مصرح به. قد لا تكون لديك الأذونات المطلوبة أو قد لا يدعم نوع حسابك هذه الميزة.",
    "This blocked me from continuing": "هذا منعني من المتابعة",
    "This challenge contains highly sensitive information. Unauthorized disclosure may result in serious legal consequences. Please read the NDA carefully before proceeding.": "يحتوي هذا التحدي على معلومات حساسة للغاية. قد يؤدي الكشف غير المصرح به إلى عواقب قانونية خطيرة. يرجى قراءة اتفاقية السرية بعناية قبل المتابعة.",
    "This company hasn't submitted any challenges yet.": "لم تقدم هذه الشركة أي تحديات بعد.",
    "This information is stored securely for verification and audit purposes.": "يتم تخزين هذه المعلومات بشكل آمن لأغراض التحقق والمراجعة.",
    "This is a challenge-specific NDA in addition to the general NDA you signed upon registration. It contains specific terms and conditions for this particular challenge.": "هذه اتفاقية سرية خاصة بالتحدي بالإضافة إلى اتفاقية السرية العامة التي وقعتها عند التسجيل. تحتوي على شروط وأحكام محددة لهذا التحدي بالذاتcontain.",
    "This is your idea. You cannot vote on it.": "هذه فكرتك. لا يمكنك التصويت عليها.",
    "This should match the name on your official documents": "يجب أن يتطابق هذا مع الاسم على مستنداتك الرسمية",
    "This signature will be cryptographically hashed and stored securely for verification purposes.": "سيتم تجزئة هذا التوقيع تشفيريًا وتخزينه بشكل آمن لأغراض التحقق.",
    "This task will be offered to other contributors": "ستُعرض هذه المهمة على مساهمين آخرين",
    "Thread": "سلسلة",
    "Threads": "السلاسل",
    "Ticket": "تذكرة",
    "Tickets": "التذاكر",
    "Time": "الوقت",
    "Time Remaining": "الوقت المتبقي",
    "Timeline": "الخط الزمني",
    "Timezone": "المنطقة الزمنية",
    "Tips and strategies for effective teamwork in distributed micro companies, based on data from hundreds of successful projects.": "نصائح واستراتيجيات للعمل الجماعي الفعال في الشركات الصغيرة الموزعة، بناءً على بيانات من مئات المشاريع الناجحة.",
    "Tips, best practices, and promotional content": "نصائح وأفضل الممارسات والمحتوى الترويجي",
    "Title": "العنوان",
    "To democratize access to talent and meaningful work by connecting skilled contributors with companies facing real-world challenges, powered by intelligent AI matching.": "لإضفاء الطابع الديمقراطي على الوصول إلى المواهب والعمل المجدي من خلال ربط المساهمين المهرة بالشركات التي تواجه تحديات واقعية، مدعومة بمطابقة الذكاء الاصطناعي الذكي.",
    "Today": "اليوم",
    "Toggle": "تبديل",
    "Tomorrow": "غداً",
    "Too Many Requests - Rate limit exceeded": "طلبات كثيرة جداً - تم تجاوز حد المعدل",
    "Top Contributors": "أهم المساهمين",
    "Top Performers": "الأفضل أداءً",
    "Top Rated Ideas": "أفضل الأفكار تقييمًا",
    "Topic": "الموضوع",
    "Topics": "المواضيع",
    "Total": "الإجمالي",
    "Total Challenges": "إجمالي التحديات",
    "Total Comments": "إجمالي التعليقات",
    "Total Community Votes": "إجمالي أصوات المجتمع",
    "Total Hours": "إجمالي الساعات",
    "Total Ideas": "إجمالي الأفكار",
    "Total Tasks": "إجمالي المهام",
    "Touch": "اللمس",
    "Track Your Progress": "تتبع تقدمك",
    "Track progress and manage your submitted challenges": "تتبع التقدم وإدارة التحديات المقدمة",
    "Track team progress, view analytics, and communicate with contributors.": "تتبع تقدم الفريق، وعرض التحليلات، والتواصل مع المساهمين.",
    "Track your challenges, monitor team progress, and drive innovation forward": "تتبع تحدياتك، راقب تقدم الفريق، وادفع الابتكار إلى الأمام",
    "Track your invitations, manage active work, and celebrate completions": "تتبع دعواتك، أدر العمل النشط، واحتفل بالإنجازات",
    "Transcript": "النص",
    "Transform Challenges": "حوّل التحديات",
    "Transform Challenges Into": "حوّل التحديات إلى",
    "Transforming Challenges Into": "تحويل التحديات إلى",
    "Trash": "سلة المحذوفات",
    "Trending": "الرائجة",
    "Try Again": "حاول مرة أخرى",
    "Try adjusting your filters or check back later for new challenges.": "حاول تعديل الفلاتر الخاصة بك أو تحقق لاحقًا من التحديات الجديدة.",
    "Try these instead:": "جرب هذه بدلاً من ذلك:",
    "Tutorial": "دروس تعليمية",
    "Tutorials": "الدروس التعليمية",
    "Type": "النوع",
    "Type your message...": "اكتب رسالتك...",
    "UI \/ UX issue": "مشكلة واجهة المستخدم \/ تجربة المستخدم",
    "UX Designer": "مصمم UX",
    "Unauthenticated requests:": "الطلبات غير المصادق عليها:",
    "Unauthorized - Invalid or missing token": "غير مصرح - رمز غير صالح أو مفقود",
    "Unavailable": "غير متاح",
    "Underline": "تحته خط",
    "Under Maintenance": "تحت الصيانة",
    "Undo": "تراجع",
    "Unfollow": "إلغاء المتابعة",
    "Unlink": "إلغاء الرابط",
    "Unmute": "إلغاء كتم الصوت",
    "Unordered List": "قائمة غير مرتبة",
    "Unprocessable Entity - Validation failed": "كيان غير قابل للمعالجة - فشل التحقق",
    "Unread": "غير مقروء",
    "Unsubscribe": "إلغاء الاشتراك",
    "Update": "تحديث",
    "Update Profile": "تحديث الملف الشخصي",
    "Update Task Assignment": "تحديث تكليف المهمة",
    "Update Contributor Profile": "تحديث ملف المساهم",
    "Updated": "تم التحديث",
    "Updated At": "تم التحديث في",
    "Updates": "التحديثات",
    "Upgrade": "ترقية",
    "Upgrades": "الترقيات",
    "Upload": "رفع",
    "Upload CV": "رفع السيرة الذاتية",
    "Upload CV Now": "ارفع السيرة الذاتية الآن",
    "Upload New CV": "رفع سيرة ذاتية جديدة",
    "Upload New Photo": "رفع صورة جديدة",
    "Upload Your CV (Optional)": "رفع سيرتك الذاتية (اختياري)",
    "Upload a new CV (PDF, DOC, or DOCX) - AI will automatically analyze and extract your skills": "ارفع سيرة ذاتية جديدة (PDF أو DOC أو DOCX) - سيقوم الذكاء الاصطناعي تلقائيًا بتحليل واستخراج مهاراتك",
    "Upload supporting files (max 10MB each)": "رفع ملفات داعمة (حد أقصى 10 ميجابايت لكل منها)",
    "Upload your CV for AI-powered skill analysis": "ارفع سيرتك الذاتية لتحليل المهارات بالذكاء الاصطناعي",
    "Upload your CV to automatically extract your skills and experience level.": "ارفع سيرتك الذاتية لاستخراج مهاراتك ومستوى خبرتك تلقائيًا.",
    "Upload your CV to improve task matching!": "ارفع سيرتك الذاتية لتحسين مطابقة المهام!",
    "Upvote": "تصويت إيجابي",
    "Urgent": "عاجل",
    "User": "مستخدم",
    "User account:": "حساب المستخدم:",
    "User:": "المستخدم:",
    "Username": "اسم المستخدم",
    "Users": "المستخدمين",
    "User & Registration": "المستخدمون والتسجيل",
    "User accounts and registration settings": "إعدادات حسابات المستخدمين والتسجيل",
    "Users agree to:": "يوافق المستخدمون على:",
    "Users retain ownership of content they create. By posting challenges or submitting work, you grant Mindova a license to display and distribute this content through the Platform.": "يحتفظ المستخدمون بملكية المحتوى الذي ينشئونه. بنشر التحديات أو تقديم العمل، فإنك تمنح Mindova ترخيصاً لعرض وتوزيع هذا المحتوى من خلال المنصة.",
    "Valid": "صالح",
    "Version": "النسخة",
    "Versions": "النسخ",
    "Video": "فيديو",
    "Video Tutorial": "فيديو تعليمي",
    "Videos": "الفيديوهات",
    "View": "عرض",
    "View All My Tasks": "عرض جميع مهامي",
    "View Challenge": "عرض التحدي",
    "View Company Profile": "عرض ملف الشركة",
    "View Details": "عرض التفاصيل",
    "View Documentation": "عرض التوثيق",
    "View Full Task Details": "عرض تفاصيل المهمة الكاملة",
    "View My Tasks": "عرض مهامي",
    "View Profile": "عرض الملف الشخصي",
    "View Solution": "عرض الحل",
    "View Success Stories": "عرض قصص النجاح",
    "View Task": "عرض المهمة",
    "View Team": "عرض الفريق",
    "View all": "عرض الكل",
    "View all teams": "عرض جميع الفرق",
    "View and manage all challenges on the platform": "عرض وإدارة جميع التحديات على المنصة",
    "View and manage all companies on the platform": "عرض وإدارة جميع الشركات على المنصة",
    "View and manage all contributors on the platform": "عرض وإدارة جميع المساهمين على المنصة",
    "View and manage your assignments": "عرض وإدارة تكليفاتك",
    "Visible": "مرئي",
    "Visit Help Center": "زيارة مركز المساعدة",
    "Volume": "مستوى الصوت",
    "Contributor": "مساهم",
    "Contributor Accounts": "حسابات المساهمين",
    "Contributor Accounts:": "حسابات المساهمين:",
    "Contributor Commitment:": "التزام المساهم:",
    "Contributor Matching (Pending)": "مطابقة المساهمين (قيد الانتظار)",
    "Contributor Matching:": "مطابقة المساهمين:",
    "Contributor Profile": "ملف المساهم",
    "Contributor identities are kept confidential to maintain impartiality": "يتم الحفاظ على هويات المساهمين سرية للحفاظ على الحياد",
    "Contributors": "المساهمين",
    "Contributors Management": "إدارة المساهمين",
    "Contributors Participated": "مساهمون شاركوا",
    "Contributors accept invitations and start working on tasks": "يقبل المساهمون الدعوات ويبدؤون العمل على المهام",
    "Contributors agree to:": "يوافق المساهمون على:",
    "Contributors are matched and teams are automatically formed": "يتم مطابقة المساهمين وتُشكّل الفرق تلقائيًا",
    "Contributors must sign an additional NDA before viewing your challenge details": "يجب على المساهمين التوقيع على اتفاقية سرية إضافية قبل عرض تفاصيل تحديك",
    "Vote": "تصويت",
    "Vote on this idea": "صوت على هذه الفكرة",
    "Votes": "الأصوات",
    "Warning": "تحذير",
    "Warning Message": "رسالة تحذير",
    "Watch Tutorial": "شاهد الفيديو التعليمي",
    "We Do": "ماذا نفعل",
    "We're Under Maintenance": "نحن تحت الصيانة",
    "We're performing scheduled maintenance to improve your experience. We'll be back shortly!": "نقوم بإجراء صيانة مجدولة لتحسين تجربتك. سنعود قريباً!",
    "We are currently performing scheduled maintenance. Please check back soon.": "نقوم حالياً بإجراء صيانة مجدولة. يرجى المحاولة مرة أخرى قريباً.",
    "We are not liable for:": "نحن غير مسؤولين عن:",
    "We reserve the right to modify these Terms at any time. Users will be notified of significant changes, and continued use of the Platform constitutes acceptance of modified Terms.": "نحتفظ بالحق في تعديل هذه الشروط في أي وقت. سيتم إخطار المستخدمين بالتغييرات الكبيرة، والاستخدام المستمر للمنصة يشكل قبولاً للشروط المعدلة.",
    "We reserve the right to suspend or terminate accounts that violate these Terms of Service or engage in fraudulent, abusive, or illegal activities.": "نحتفظ بالحق في تعليق أو إنهاء الحسابات التي تنتهك شروط الخدمة هذه أو تنخرط في أنشطة احتيالية أو مسيئة أو غير قانونية.",
    "We were amazed by the quality of talent Mindova connected us with. The AI-formed team had exactly the skills we needed, and they delivered a production-ready platform that exceeded our expectations. This changed our business trajectory.": "لقد ذهلنا بجودة المواهب التي ربطنا بها Mindova. كان لدى الفريق المُشكّل بالذكاء الاصطناعي المهارات التي نحتاجها بالضبط، وقدموا منصة جاهزة للإنتاج تجاوزت توقعاتنا. هذا غير مسار أعمالنا.",
    "Website": "الموقع الإلكتروني",
    "Weekly Progress Reports": "تقارير التقدم الأسبوعية",
    "Weekly digest": "ملخص أسبوعي",
    "Welcome": "مرحباً",
    "Welcome Back to": "مرحبًا بعودتك إلى",
    "Welcome back,": "مرحبًا بعودتك،",
    "Welcome to Mindova": "مرحباً بك في ميندوفا",
    "What": "ماذا",
    "What Our": "ما يقوله",
    "What You Get": "ما تحصل عليه",
    "What can you do?": "ماذا يمكنك أن تفعل؟",
    "What happened?": "ماذا حدث؟",
    "What happens after I'm invited to a team?": "ماذا يحدث بعد دعوتي إلى فريق؟",
    "What happens next?": "ماذا سيحدث بعد ذلك؟",
    "What is a \"micro company\"?": "ما هي \"الشركة الصغيرة\"؟",
    "What is this page?": "ما هي هذه الصفحة؟",
    "What should I do?": "ماذا يجب أن أفعل؟",
    "What to Deliver": "ماذا تقدم",
    "What's the difference between Contributor and Company accounts?": "ما الفرق بين حسابات المساهمين والشركات؟",
    "Who becomes the team leader?": "من يصبح قائد الفريق؟",
    "Why": "لماذا",
    "Why Choose Mindova?": "لماذا تختار ميندوفا؟",
    "Why You Were Matched": "لماذا تم مطابقتك",
    "Why is this required?": "لماذا هذا مطلوب؟",
    "Width": "العرض",
    "Work Begins:": "بدء العمل:",
    "Work Submissions": "تقديمات العمل",
    "Work in small, focused teams for maximum efficiency and collaboration": "العمل في فرق صغيرة ومركزة لأقصى قدر من الكفاءة والتعاون",
    "Works": "يعمل",
    "Workstream": "سير العمل",
    "Workstreams & Tasks": "سير العمل والمهام",
    "Years of Experience": "سنوات الخبرة",
    "Yes": "نعم",
    "Yes! View your challenge page to see all formed teams, team members, their skills, roles, and real-time progress. You can access detailed analytics, communication history, and performance metrics for each team and member.": "نعم! اعرض صفحة التحدي الخاصة بك لرؤية جميع الفرق المشكلة وأعضاء الفريق ومهاراتهم وأدوارهم والتقدم في الوقت الفعلي. يمكنك الوصول إلى التحليلات التفصيلية وسجل الاتصالات ومقاييس الأداء لكل فريق وعضو.",
    "Yesterday": "الأمس",
    "You are responsible for maintaining the confidentiality of your account credentials and for all activities that occur under your account. You agree to notify us immediately of any unauthorized use of your account.": "أنت مسؤول عن الحفاظ على سرية بيانات اعتماد حسابك وعن جميع الأنشطة التي تحدث تحت حسابك. توافق على إخطارنا فوراً بأي استخدام غير مصرح به لحسابك.",
    "You can decline invitations before accepting them. After accepting, please communicate with your team leader if you need to leave, as it may affect the project timeline. We encourage open communication to minimize disruption to the team.": "يمكنك رفض الدعوات قبل قبولها. بعد القبول، يرجى التواصل مع قائد فريقك إذا كنت بحاجة للمغادرة، لأن ذلك قد يؤثر على الجدول الزمني للمشروع. نشجع التواصل المفتوح لتقليل الاضطراب في الفريق.",
    "You can see all workstreams and tasks as a team manager.": "يمكنك رؤية جميع سير العمل والمهام كمدير فريق.",
    "You can see the full challenge context as a team manager.": "يمكنك رؤية سياق التحدي الكامل كمدير فريق.",
    "You currently have an active task:": "لديك حاليًا مهمة نشطة:",
    "You haven't been invited to any teams. Complete your profile and wait for task invitations!": "لم تتم دعوتك إلى أي فرق. أكمل ملفك الشخصي وانتظر دعوات المهام!",
    "You receive progress updates while contributor identities remain confidential": "تتلقى تحديثات التقدم بينما تظل هويات المساهمين سرية",
    "You will maintain strict confidentiality of all challenge information": "ستحافظ على السرية الصارمة لجميع معلومات التحدي",
    "You will not disclose any details outside your assigned team": "لن تكشف عن أي تفاصيل خارج فريقك المُكلف",
    "You'll receive detailed feedback and an AI score (0-100)": "ستتلقى ملاحظات مفصلة ونتيجة ذكاء اصطناعي (0-100)",
    "Your Assignment": "تكليفك",
    "Your Challenge is Protected by NDA": "تحديك محمي باتفاقية السرية",
    "Your Challenges": "تحدياتك",
    "Your Comment": "تعليقك",
    "Your Field:": "مجالك:",
    "Your Innovation Hub": "مركز الابتكار الخاص بك",
    "Your Profile & Skills": "ملفك الشخصي ومهاراتك",
    "Your Role:": "دورك:",
    "Your Skills": "مهاراتك",
    "Your Skills:": "مهاراتك:",
    "Your Strengths:": "نقاط قوتك:",
    "Your challenge is securely stored in our database": "يتم تخزين تحديك بشكل آمن في قاعدة بياناتنا",
    "Your challenge requires NDA signing by default": "يتطلب تحديك التوقيع على اتفاقية السرية بشكل افتراضي",
    "Your command center for tasks, teams, and community impact": "مركز التحكم الخاص بك للمهام والفرق والتأثير المجتمعي",
    "Your comment will be analyzed by AI for quality and relevance. High-quality contributions (score 7+) will notify the challenge owner.": "سيتم تحليل تعليقك بواسطة الذكاء الاصطناعي من حيث الجودة والصلة. المساهمات عالية الجودة (نتيجة 7+) ستخطر صاحب التحدي.",
    "Your electronic signature will be recorded along with:": "سيتم تسجيل توقيعك الإلكتروني مع:",
    "Your information is always safe with us": "معلوماتك آمنة دائمًا معنا",
    "Your name": "اسمك",
    "Your password is encrypted with industry-leading security": "كلمة المرور الخاصة بك مشفرة بأمان رائد في الصناعة",
    "Your reputation increases based on completed tasks, quality of work submissions, team contributions, and peer reviews. It starts at 50 and can grow through consistent positive engagement. Higher reputation scores lead to better task matches and leadership opportunities.": "تزداد سمعتك بناءً على المهام المكتملة وجودة عمليات الإرسال ومساهمات الفريق ومراجعات الأقران. تبدأ عند 50 ويمكن أن تنمو من خلال المشاركة الإيجابية المستمرة. تؤدي نقاط السمعة الأعلى إلى مطابقات مهام أفضل وفرص قيادية.",
    "Your solution is being analyzed by AI. This usually takes 30-60 seconds.": "يتم تحليل حلك بواسطة الذكاء الاصطناعي. يستغرق هذا عادةً 30-60 ثانية.",
    "Your solution must meet all criteria below": "يجب أن يستوفي حلك جميع المعايير أدناه",
    "Your solution scored below the 70% threshold and needs improvement.": "حصل حلك على درجة أقل من عتبة 70% ويحتاج إلى تحسين.",
    "Zip Code": "الرمز البريدي",
    "Zoom In": "تكبير",
    "Zoom Out": "تصغير",
    "advanced": "متقدم",
    "and": "و",
    "avg score": "متوسط النتيجة",
    "beginner": "مبتدئ",
    "comment": "تعليق",
    "completed": "مكتمل",
    "d ago": "ي منذ",
    "default": "افتراضي",
    "e.g., 5.5": "مثل، 5.5",
    "e.g., CR-123456789": "مثل، CR-123456789",
    "e.g., Healthcare, Technology, Finance": "مثل، الرعاية الصحية، التكنولوجيا، التمويل",
    "e.g., Reduce office energy consumption": "مثل، تقليل استهلاك الطاقة في المكتب",
    "e.g., Smart Lighting with Motion Sensors": "مثل، الإضاءة الذكية بأجهزة استشعار الحركة",
    "expert": "خبير",
    "final score": "النتيجة النهائية",
    "for innovation": "من أجل الابتكار",
    "h": "س",
    "h ago": "س منذ",
    "h left": "ساعة متبقية",
    "h\/week available": "ساعة\/أسبوع متاحة",
    "high-quality insights": "رؤى عالية الجودة",
    "hours": "ساعات",
    "hours contributed": "ساعات مساهمة",
    "hours logged": "ساعات مسجلة",
    "hours to accept": "ساعات للقبول",
    "https:\/\/yourcompany.com": "https:\/\/yourcompany.com",
    "ideas submitted": "أفكار مقدمة",
    "intermediate": "متوسط",
    "items selected": "عناصر محددة",
    "john@example.com": "john@example.com",
    "logged": "مسجل",
    "m ago": "د منذ",
    "more characters": "حرفًا أكثر",
    "of": "من",
    "or": "أو",
    "per page": "لكل صفحة",
    "points": "نقاط",
    "recently": "مؤخرًا",
    "requests per minute": "طلبات في الدقيقة",
    "results": "نتيجة",
    "score": "نتيجة",
    "status_active": "نشط",
    "status_analyzed": "تم التحليل",
    "status_completed": "مكتمل",
    "status_failed": "فشل",
    "status_in_progress": "قيد التنفيذ",
    "status_inactive": "غير نشط",
    "status_pending": "قيد الانتظار",
    "status_processing": "قيد المعالجة",
    "task": "مهمة",
    "tasks": "مهام",
    "tasks completed": "مهام مكتملة",
    "to": "إلى",
    "unique contributors engaged": "مساهمون فريدون مشاركون",
    "contributors working": "مساهمون يعملون",
    "years": "سنوات",
    "years experience": "سنوات خبرة",
    "your.email@example.com": "your.email@example.com",
    "your@email.com": "your@email.com",
    "{1} comment|[2,*] comments": "{1} تعليق|[2,*] تعليقات",
    "{1} vote|[2,*] votes": "{1} صوت|[2,*] أصوات",
    "← Back to Challenge": "← العودة إلى التحدي",
    "← Back to Community Challenges": "← العودة إلى تحديات المجتمع",
    "⏳ Your CV is being analyzed... Skills will appear here soon.": "⏳ يتم تحليل سيرتك الذاتية... ستظهر المهارات هنا قريبًا.",
    "⚠ Areas for Improvement": "⚠ مجالات التحسين",
    "✓ Brief Analyzed & Refined": "✓ تم تحليل وتحسين الملخص",
    "✓ Strengths": "✓ نقاط القوة",
    "✓ Contributors Matched & Invited": "✓ تم مطابقة ودعوة المساهمين",
    "Mindova Platform Administrator": "مسؤول منصة ميندوفا",
    "Last login:": "آخر تسجيل دخول:",
    "USERS": "المستخدمين",
    "VOLUNTEERS": "المساهمين",
    "COMPANIES": "الشركات",
    "ACTIVE": "نشط",
    "Total registered users": "إجمالي المستخدمين المسجلين",
    "Active contributors": "المساهمين النشطين",
    "Registered companies": "الشركات المسجلة",
    "Active challenges": "التحديات النشطة",
    "Certificates Issued": "الشهادات الصادرة",
    "Certificates": "الشهادات",
    "Certificate generation settings": "إعدادات إنشاء الشهادات",
    "Auto-Issue Certificates": "إصدار الشهادات تلقائياً",
    "Certificate Expiry (Days)": "انتهاء صلاحية الشهادة (بالأيام)",
    "Challenge Status Distribution": "توزيع حالة التحديات",
    "Recent Challenges": "التحديات الأخيرة",
    "View All": "عرض الكل",
    "No challenges yet": "لا توجد تحديات بعد",
    "Top Contributors": "أفضل المساهمين",
    "No field specified": "لم يتم تحديد المجال",
    "No contributors yet": "لا يوجد مساهمين بعد",
    "Active Companies": "الشركات النشطة",
    "No industry": "لا يوجد مجال صناعي",
    "challenges": "تحديات",
    "No companies yet": "لا توجد شركات بعد",
    "total": "المجموع",
    "in progress": "قيد التنفيذ",
    "tasks done": "مهام منجزة",
    "working now": "يعملون الآن",
    "approved": "معتمد",
    "Latest Challenge": "أحدث تحدي",
    "Your most recently submitted challenge": "آخر تحدي قمت بتقديمه",
    "View All Challenges": "عرض جميع التحديات",
    "Solution Progress": "تقدم الحلول",
    "Working": "يعملون",
    "contributors": "مساهمين",
    "Invited": "مدعوين",
    "pending": "قيد الانتظار",
    "Submissions": "التسليمات",
    "received": "مستلم",
    "Approved": "معتمد",
    "solutions": "حلول",
    "Tasks with Solutions": "المهام ذات الحلول",
    "of tasks have approved solutions": "من المهام لديها حلول معتمدة",
    "Average Quality Score": "متوسط درجة الجودة",
    "N\/A": "غير متاح",
    "Excellent quality submissions": "تسليمات بجودة ممتازة",
    "Good quality submissions": "تسليمات بجودة جيدة",
    "Average quality submissions": "تسليمات بجودة متوسطة",
    "Needs improvement": "يحتاج إلى تحسين",
    "No submissions scored yet": "لم يتم تقييم أي تسليمات بعد",
    "View All Submissions & Details": "عرض جميع التسليمات والتفاصيل",
    "✓ Complexity Evaluated (Score: :score)": "✓ تم تقييم التعقيد (الدرجة: :score)",
    "✓ Tasks Created (:count tasks)": "✓ تم إنشاء المهام (:count مهمة)",
    "+:count more": "+:count المزيد",
    "Give your challenge a clear, descriptive name": "أعطِ تحديك اسماً واضحاً ووصفياً",
    "e.g., Reduce office energy consumption by 30%": "مثال: تقليل استهلاك الطاقة في المكتب بنسبة 30%",
    "Explain your challenge in detail - the more context, the better": "اشرح تحديك بالتفصيل - كلما زادت التفاصيل، كان ذلك أفضل",
    "Min 100 characters": "الحد الأدنى 100 حرف",
    "Set timeframes for your challenge": "حدد الإطار الزمني لتحديك",
    "When should contributors submit their work?": "متى يجب على المساهمين تسليم عملهم؟",
    "When should the challenge be fully completed?": "متى يجب إكمال التحدي بالكامل؟",
    "Challenge PDF Document": "ملف PDF للتحدي",
    "Upload supporting documentation": "ارفع المستندات الداعمة",
    "Choose PDF File": "اختر ملف PDF",
    "or drag and drop PDF here": "أو اسحب وأفلت ملف PDF هنا",
    "PDF only": "PDF فقط",
    "Max 10 MB": "الحد الأقصى 10 ميجابايت",
    "How PDF documents enhance analysis": "كيف تعزز مستندات PDF التحليل",
    "AI reads PDF alongside your description for complete understanding": "يقرأ الذكاء الاصطناعي ملف PDF مع وصفك لفهم كامل",
    "Extracts technical requirements and specifications": "يستخرج المتطلبات والمواصفات التقنية",
    "Generates more accurate task breakdowns": "يولد تقسيمات مهام أكثر دقة",
    "NDA Protection": "حماية اتفاقية عدم الإفصاح",
    "All challenges are protected by NDAs. Contributors must sign before viewing your challenge details.": "جميع التحديات محمية باتفاقيات عدم الإفصاح. يجب على المساهمين التوقيع قبل عرض تفاصيل تحديك.",
    "AI-Powered Analysis": "تحليل بالذكاء الاصطناعي",
    "Our AI analyzes your challenge, breaks it into tasks, and matches qualified contributors automatically.": "يحلل ذكاؤنا الاصطناعي تحديك، ويقسمه إلى مهام، ويطابق المساهمين المؤهلين تلقائياً.",
    "Challenge Submitted": "تم تقديم التحدي",
    "Securely stored in our database": "مخزن بشكل آمن في قاعدة بياناتنا",
    "Brief refined & complexity evaluated": "تحسين الملخص وتقييم التعقيد",
    "Task Breakdown": "تقسيم المهام",
    "Decomposed into manageable tasks": "تقسيم إلى مهام قابلة للإدارة",
    "Contributor Matching": "مطابقة المساهمين",
    "Qualified contributors assigned": "تعيين المساهمين المؤهلين",
    "Connect talented contributors with real-world challenges. Our AI matches skills, creates teams, and drives meaningful impact.": "ربط المساهمين الموهوبين بتحديات العالم الحقيقي. ذكاؤنا الاصطناعي يطابق المهارات، وينشئ الفرق، ويحقق تأثيراً ذا معنى.",
    "Companies post real-world challenges they need solved": "تنشر الشركات تحديات العالم الحقيقي التي تحتاج إلى حل",
    "Our AI breaks down challenges into tasks and matches skills": "يقسم ذكاؤنا الاصطناعي التحديات إلى مهام ويطابق المهارات",
    "Join thousands of contributors and companies creating meaningful change": "انضم إلى آلاف المساهمين والشركات التي تصنع تغييراً ذا معنى",
    "Create free account": "أنشئ حساباً مجانياً",
    "Join Our Innovation Community": "انضم إلى مجتمع الابتكار لدينا",
    "Connect with companies, contribute your skills, and grow your professional portfolio with AI-powered matching.": "تواصل مع الشركات، وساهم بمهاراتك، وطوّر محفظتك المهنية مع المطابقة بالذكاء الاصطناعي.",
    "I want to": "أريد أن",
    "Post challenges for solutions": "أنشر تحديات للحصول على حلول",
    "Your Full Name": "الاسم الكامل",
    "Create a password": "أنشئ كلمة مرور",
    "Confirm your password": "أكد كلمة المرور",
    "Enter company name": "أدخل اسم الشركة",
    "Company Website": "موقع الشركة",
    "https:\/\/example.com": "https:\/\/example.com",
    "Back to Submissions": "العودة إلى التقديمات",
    "Submission Description": "وصف التقديم",
    "View Deliverable": "عرض المُسلّم",
    "AI Quality Analysis": "تحليل جودة الذكاء الاصطناعي",
    "Strengths": "نقاط القوة",
    "Areas for Improvement": "مجالات التحسين",
    "Timeliness": "الالتزام بالوقت",
    "Communication": "التواصل",
    "Your Decision": "قرارك",
    "Accept this submission as complete": "قبول هذا التقديم كمكتمل",
    "Request Revision": "طلب مراجعة",
    "Ask for changes or improvements": "طلب تغييرات أو تحسينات",
    "Your Feedback": "ملاحظاتك",
    "Estimated": "المقدر",
    "Actual": "الفعلي",
    "AI analysis pending": "تحليل الذكاء الاصطناعي قيد الانتظار",
    "Quick Stats": "إحصائيات سريعة",
    "No Submissions Yet": "لا توجد تقديمات بعد",
    "Challenge Process": "عملية التحدي",
    "Work In Progress": "العمل قيد التنفيذ",
    "Not started yet": "لم يبدأ بعد",
    "Challenge Completed": "اكتمل التحدي",
    "Pending completion": "في انتظار الإكمال",
    "Company Information": "معلومات الشركة",
    "Contact Email": "البريد الإلكتروني للتواصل",
    "Not specified": "غير محدد",
    "Commercial Register": "السجل التجاري",
    "Company Description": "وصف الشركة",
    "Challenge Type": "نوع التحدي",
    "Submit Your Review": "قدّم مراجعتك",
    "Rate the Submission (Optional)": "قيّم التقديم (اختياري)",
    "Submit Review": "إرسال المراجعة",
    "Provide detailed, constructive feedback about the submission...": "قدّم ملاحظات مفصلة وبناءة حول التقديم...",
    "This submission doesn't meet requirements": "هذا التقديم لا يستوفي المتطلبات",
    "Review History": "سجل المراجعات",
    "Deliverable": "المُسلّم",
    "Pending Review": "في انتظار المراجعة",
    "Revision Requested": "طلب مراجعة",
    "Task Details": "تفاصيل المهمة",
    "Workstream": "مسار العمل",
    "Experience": "الخبرة",
    "Years": "سنوات",
    "Reputation": "السمعة",
    "Skills": "المهارات",
    "Complexity": "التعقيد",
    "AI Analysis": "تحليل الذكاء الاصطناعي",
    "Excellent Quality": "جودة ممتازة",
    "Good Quality": "جودة جيدة",
    "Needs Improvement": "بحاجة للتحسين",
    "ID": "المعرف",
    "Reviews": "المراجعات",
    "Total registered users": "إجمالي المستخدمين المسجلين",
    "Active contributors": "المساهمون النشطون",
    "Registered companies": "الشركات المسجلة",
    "Active challenges": "التحديات النشطة",
    "Total Challenges": "إجمالي التحديات",
    "Total Tasks": "إجمالي المهام",
    "Task Assignments": "تعيينات المهام",
    "Certificates Issued": "الشهادات الصادرة",
    "Challenge Status Distribution": "توزيع حالة التحديات",
    "Recent Challenges": "التحديات الأخيرة",
    "Top Contributors": "أفضل المساهمين",
    "Active Companies": "الشركات النشطة",
    "View All": "عرض الكل",
    "points": "نقاط",
    "challenges": "تحديات",
    "No challenges yet": "لا توجد تحديات بعد",
    "No contributors yet": "لا يوجد مساهمون بعد",
    "No companies yet": "لا توجد شركات بعد",
    "No industry": "لا توجد صناعة",
    "USERS": "المستخدمون",
    "VOLUNTEERS": "المساهمون",
    "COMPANIES": "الشركات",
    "ACTIVE": "نشط",
    "Welcome back,": "مرحباً بعودتك،",
    "Mindova Platform Administrator": "مدير منصة مندوڤا",
    "Last login:": "آخر تسجيل دخول:",

    "Feature Controls": "التحكم في الميزات",
    "Enable or disable platform features": "تمكين أو تعطيل ميزات المنصة",

    "Site Name": "اسم الموقع",
    "The name of your platform": "اسم منصتك",
    "Site Tagline": "شعار الموقع",
    "A short description or slogan for your platform": "وصف قصير أو شعار لمنصتك",
    "Contact Email": "البريد الإلكتروني للتواصل",
    "Primary contact email for the platform": "البريد الإلكتروني الرئيسي للتواصل مع المنصة",
    "Support Phone": "هاتف الدعم",
    "Support phone number (optional)": "رقم هاتف الدعم (اختياري)",

    "Email Verification Required": "التحقق من البريد الإلكتروني مطلوب",
    "Require users to verify their email before accessing the platform": "يتطلب من المستخدمين التحقق من بريدهم الإلكتروني قبل الوصول إلى المنصة",
    "Profile Completion Required": "إكمال الملف الشخصي مطلوب",
    "Require users to complete their profile before accessing features": "يتطلب من المستخدمين إكمال ملفهم الشخصي قبل الوصول إلى الميزات",
    "LinkedIn Authentication": "مصادقة LinkedIn",
    "Allow users to sign in with LinkedIn": "السماح للمستخدمين بتسجيل الدخول باستخدام LinkedIn",
    "Contributor Registration": "تسجيل المساهمين",
    "Allow new contributors to register": "السماح للمساهمين الجدد بالتسجيل",
    "Company Registration": "تسجيل الشركات",
    "Allow new companies to register": "السماح للشركات الجديدة بالتسجيل",
    "Max Login Attempts": "الحد الأقصى لمحاولات تسجيل الدخول",
    "Maximum failed login attempts before lockout": "الحد الأقصى لمحاولات تسجيل الدخول الفاشلة قبل القفل",
    "Login Lockout Duration": "مدة قفل تسجيل الدخول",
    "Minutes to lock user after max failed attempts": "الدقائق لقفل المستخدم بعد الحد الأقصى من المحاولات الفاشلة",

    "Challenges Enabled": "التحديات مفعلة",
    "Enable the challenges feature on the platform": "تمكين ميزة التحديات على المنصة",
    "Challenge Approval Required": "موافقة التحدي مطلوبة",
    "Require admin approval before challenges go live": "يتطلب موافقة المسؤول قبل نشر التحديات",
    "Contributor Challenges": "تحديات المساهمين",
    "Allow contributors to submit their own challenges": "السماح للمساهمين بتقديم تحدياتهم الخاصة",
    "Max Challenges Per Company": "الحد الأقصى للتحديات لكل شركة",
    "Maximum active challenges a company can have (0 = unlimited)": "الحد الأقصى للتحديات النشطة التي يمكن أن تمتلكها الشركة (0 = غير محدود)",
    "Max Team Size": "الحد الأقصى لحجم الفريق",
    "Maximum number of contributors per team": "الحد الأقصى لعدد المساهمين في كل فريق",
    "Auto-Decompose Tasks": "تقسيم المهام تلقائياً",
    "Automatically use AI to decompose challenges into tasks": "استخدام الذكاء الاصطناعي تلقائياً لتقسيم التحديات إلى مهام",

    "AI CV Parsing": "تحليل السيرة الذاتية بالذكاء الاصطناعي",
    "Use AI to extract skills and experience from uploaded CVs": "استخدام الذكاء الاصطناعي لاستخراج المهارات والخبرات من السير الذاتية المرفوعة",
    "AI Team Matching": "مطابقة الفريق بالذكاء الاصطناعي",
    "Use AI to match contributors to challenges and form teams": "استخدام الذكاء الاصطناعي لمطابقة المساهمين مع التحديات وتشكيل الفرق",
    "AI Task Decomposition": "تقسيم المهام بالذكاء الاصطناعي",
    "Use AI to break down challenges into manageable tasks": "استخدام الذكاء الاصطناعي لتقسيم التحديات إلى مهام قابلة للإدارة",
    "AI Challenge Analysis": "تحليل التحديات بالذكاء الاصطناعي",
    "Use AI to analyze and categorize challenges": "استخدام الذكاء الاصطناعي لتحليل وتصنيف التحديات",
    "Daily AI Request Limit": "حد طلبات الذكاء الاصطناعي اليومي",
    "Maximum AI API requests per day (0 = unlimited)": "الحد الأقصى لطلبات API للذكاء الاصطناعي يومياً (0 = غير محدود)",

    "Enable email notifications for users": "تمكين إشعارات البريد الإلكتروني للمستخدمين",
    "Enable in-app notification system": "تمكين نظام الإشعارات داخل التطبيق",
    "Admin Notification Email": "بريد إشعارات المسؤول",
    "Email to receive admin notifications (leave empty to use contact email)": "البريد الإلكتروني لتلقي إشعارات المسؤول (اتركه فارغاً لاستخدام بريد التواصل)",
    "Notify admin when new users register": "إشعار المسؤول عند تسجيل مستخدمين جدد",
    "Notify admin when new challenges are submitted": "إشعار المسؤول عند تقديم تحديات جديدة",
    "Notify admin when new companies register": "إشعار المسؤول عند تسجيل شركات جديدة",

    "Enable community features (comments, voting, ideas)": "تمكين ميزات المجتمع (التعليقات والتصويت والأفكار)",
    "Leaderboard": "لوحة المتصدرين",
    "Show contributor leaderboard": "عرض لوحة متصدري المساهمين",
    "Public Profiles": "الملفات الشخصية العامة",
    "Allow public viewing of user profiles": "السماح بعرض ملفات المستخدمين علنياً",
    "Comments": "التعليقات",
    "Allow users to comment on challenges and ideas": "السماح للمستخدمين بالتعليق على التحديات والأفكار",
    "Voting": "التصويت",
    "Allow users to vote on ideas and comments": "السماح للمستخدمين بالتصويت على الأفكار والتعليقات",

    "Enable certificate generation for completed challenges": "تمكين إنشاء الشهادات للتحديات المكتملة",
    "Automatically issue certificates when challenges are completed": "إصدار الشهادات تلقائياً عند إكمال التحديات",
    "Days until certificates expire (0 = never)": "الأيام حتى انتهاء صلاحية الشهادات (0 = لا تنتهي)",

    "API Access": "الوصول إلى API",
    "Enable API access for external integrations": "تمكين الوصول إلى API للتكاملات الخارجية",
    "Maximum API requests per minute per user": "الحد الأقصى لطلبات API في الدقيقة لكل مستخدم",
    "Public API Documentation": "وثائق API العامة",
    "Make API documentation publicly accessible": "جعل وثائق API متاحة للعموم",

    "Force HTTPS": "فرض HTTPS",
    "Redirect all HTTP requests to HTTPS": "إعادة توجيه جميع طلبات HTTP إلى HTTPS",
    "Session Lifetime (Minutes)": "مدة الجلسة (بالدقائق)",
    "How long user sessions remain active": "مدة بقاء جلسات المستخدمين نشطة",
    "Minimum Password Length": "الحد الأدنى لطول كلمة المرور",
    "Minimum required password length": "الحد الأدنى المطلوب لطول كلمة المرور",
    "General NDA Required": "اتفاقية عدم الإفشاء العامة مطلوبة",
    "Require contributors to sign general NDA": "يتطلب من المساهمين توقيع اتفاقية عدم الإفشاء العامة",
    "Challenge NDA Required": "اتفاقية عدم الإفشاء للتحدي مطلوبة",
    "Require challenge-specific NDA for sensitive challenges": "يتطلب اتفاقية عدم إفشاء خاصة بالتحدي للتحديات الحساسة",

    "File upload limits and allowed types": "حدود رفع الملفات والأنواع المسموح بها",
    "Max File Upload Size (MB)": "الحد الأقصى لحجم رفع الملف (ميجابايت)",
    "Maximum file upload size in megabytes": "الحد الأقصى لحجم رفع الملف بالميجابايت",
    "Allowed File Types": "أنواع الملفات المسموح بها",
    "Comma-separated list of allowed file extensions": "قائمة بامتدادات الملفات المسموح بها مفصولة بفواصل",
    "Max CV Size (MB)": "الحد الأقصى لحجم السيرة الذاتية (ميجابايت)",
    "Maximum CV/resume file size in megabytes": "الحد الأقصى لحجم ملف السيرة الذاتية بالميجابايت",
    "Max Attachments Per Challenge": "الحد الأقصى للمرفقات لكل تحدي",
    "Maximum number of attachments per challenge": "الحد الأقصى لعدد المرفقات لكل تحدي",

    "Settings updated successfully": "تم تحديث الإعدادات بنجاح",
    "Invalid setting": "إعداد غير صالح",
    "Setting not found": "الإعداد غير موجود",
    "Value must be a number": "يجب أن تكون القيمة رقماً",
    "updated successfully": "تم التحديث بنجاح",
    "enabled": "مفعّل",
    "disabled": "معطّل",
    "Cache cleared for group: :group": "تم مسح ذاكرة التخزين المؤقت للمجموعة: :group",
    "Export Settings": "تصدير الإعدادات",
    "Save All Changes": "حفظ جميع التغييرات",
    "Total Settings": "إجمالي الإعدادات",
    "Groups": "المجموعات",
    "Boolean Toggles": "مفاتيح التبديل",
    "Number Settings": "إعدادات الأرقام",
    "Text Settings": "إعدادات النص",
    "Toggle": "تبديل",
    "Platform Settings": "إعدادات المنصة",
    "Manage all platform configuration from one place": "إدارة جميع إعدادات المنصة من مكان واحد",
    "Configure your platform settings across different categories": "تكوين إعدادات منصتك عبر فئات مختلفة",

    "Complete control over your platform configuration": "تحكم كامل في إعدادات منصتك",
    "Search settings...": "البحث في الإعدادات...",
    "Quick Presets": "الإعدادات المسبقة السريعة",
    "Apply this preset? This will override related settings.": "تطبيق هذا الإعداد المسبق؟ سيؤدي ذلك إلى تجاوز الإعدادات ذات الصلة.",
    "Failed to apply preset": "فشل في تطبيق الإعداد المسبق",
    "Error applying preset": "خطأ في تطبيق الإعداد المسبق",
    "Error clearing cache": "خطأ في مسح الذاكرة المؤقتة",
    "Import Settings": "استيراد الإعدادات",
    "Paste JSON configuration": "لصق تكوين JSON",
    "Import failed": "فشل الاستيراد",
    "Invalid JSON format": "تنسيق JSON غير صالح",
    "All caches cleared successfully": "تم مسح جميع ذاكرات التخزين المؤقت بنجاح",
    "Failed to clear cache": "فشل في مسح الذاكرة المؤقتة",
    ":name preset applied successfully": "تم تطبيق الإعداد المسبق :name بنجاح",
    ":count settings imported successfully": "تم استيراد :count إعداد بنجاح",
    ":count settings updated": "تم تحديث :count إعداد",
    "Preset not found": "الإعداد المسبق غير موجود",

    "Production": "الإنتاج",
    "Optimized for live production environment": "محسن لبيئة الإنتاج الفعلية",
    "Development": "التطوير",
    "Settings optimized for development": "إعدادات محسنة للتطوير",
    "Maintenance": "الصيانة",
    "Enable maintenance mode for updates": "تمكين وضع الصيانة للتحديثات",
    "Maximum Security": "الحد الأقصى من الأمان",
    "Enhanced security settings": "إعدادات أمان محسنة",

    "Branding": "العلامة التجارية",
    "Logo, colors, and visual identity": "الشعار والألوان والهوية البصرية",
    "Primary Brand Color": "لون العلامة التجارية الأساسي",
    "Main color used throughout the platform": "اللون الرئيسي المستخدم في جميع أنحاء المنصة",
    "Secondary Brand Color": "لون العلامة التجارية الثانوي",
    "Secondary accent color": "لون التمييز الثانوي",
    "Logo URL": "رابط الشعار",
    "URL to your platform logo image": "رابط صورة شعار منصتك",
    "Favicon URL": "رابط الأيقونة",
    "URL to your platform favicon": "رابط أيقونة منصتك",
    "Footer Text": "نص التذييل",
    "Copyright text shown in footer": "نص حقوق النشر المعروض في التذييل",

    "Email Settings": "إعدادات البريد الإلكتروني",
    "Email configuration and templates": "تكوين البريد الإلكتروني والقوالب",
    "From Name": "اسم المرسل",
    "Name that appears in sent emails": "الاسم الذي يظهر في رسائل البريد الإلكتروني المرسلة",
    "From Email Address": "عنوان البريد الإلكتروني للمرسل",
    "Email address used as sender": "عنوان البريد الإلكتروني المستخدم كمرسل",
    "Reply-To Address": "عنوان الرد",
    "Email address for replies (optional)": "عنوان البريد الإلكتروني للردود (اختياري)",
    "Email Digests": "ملخصات البريد الإلكتروني",
    "Send daily/weekly email digest summaries": "إرسال ملخصات يومية/أسبوعية عبر البريد الإلكتروني",
    "Digest Frequency": "تكرار الملخص",
    "How often to send email digests": "عدد مرات إرسال ملخصات البريد الإلكتروني",

    "Social Media": "وسائل التواصل الاجتماعي",
    "Social media links and sharing": "روابط ومشاركة وسائل التواصل الاجتماعي",
    "Facebook URL": "رابط فيسبوك",
    "Link to your Facebook page": "رابط صفحتك على فيسبوك",
    "Twitter/X URL": "رابط تويتر/X",
    "Link to your Twitter/X profile": "رابط ملفك الشخصي على تويتر/X",
    "LinkedIn URL": "رابط لينكد إن",
    "Link to your LinkedIn company page": "رابط صفحة شركتك على لينكد إن",
    "Instagram URL": "رابط إنستغرام",
    "Link to your Instagram profile": "رابط ملفك الشخصي على إنستغرام",
    "YouTube URL": "رابط يوتيوب",
    "Link to your YouTube channel": "رابط قناتك على يوتيوب",
    "Social Sharing": "المشاركة الاجتماعية",
    "Allow sharing challenges and ideas on social media": "السماح بمشاركة التحديات والأفكار على وسائل التواصل الاجتماعي",

    "SEO & Meta": "تحسين محركات البحث والبيانات الوصفية",
    "Search engine optimization settings": "إعدادات تحسين محركات البحث",
    "Meta Title": "العنوان الوصفي",
    "Default meta title for SEO": "العنوان الوصفي الافتراضي لتحسين محركات البحث",
    "Meta Description": "الوصف الوصفي",
    "Default meta description for search engines": "الوصف الوصفي الافتراضي لمحركات البحث",
    "Meta Keywords": "الكلمات المفتاحية",
    "Comma-separated keywords for SEO": "كلمات مفتاحية مفصولة بفواصل لتحسين محركات البحث",
    "Social Share Image": "صورة المشاركة الاجتماعية",
    "Default image when sharing on social media": "الصورة الافتراضية عند المشاركة على وسائل التواصل الاجتماعي",
    "Robots.txt Content": "محتوى Robots.txt",
    "Content for robots.txt file": "محتوى ملف robots.txt",
    "Sitemap Generation": "إنشاء خريطة الموقع",
    "Automatically generate XML sitemap": "إنشاء خريطة موقع XML تلقائياً",

    "Analytics": "التحليلات",
    "Tracking and analytics integration": "تكامل التتبع والتحليلات",
    "Google Analytics ID": "معرف Google Analytics",
    "Google Analytics tracking ID (GA4)": "معرف تتبع Google Analytics (GA4)",
    "Facebook Pixel ID": "معرف Facebook Pixel",
    "Facebook Pixel tracking ID": "معرف تتبع Facebook Pixel",
    "Hotjar Site ID": "معرف موقع Hotjar",
    "Hotjar site tracking ID": "معرف تتبع موقع Hotjar",
    "Custom Head Scripts": "نصوص برمجية مخصصة للرأس",
    "Custom scripts to inject in the head section": "نصوص برمجية مخصصة للإدراج في قسم الرأس",
    "Custom Body Scripts": "نصوص برمجية مخصصة للجسم",
    "Custom scripts to inject before body close": "نصوص برمجية مخصصة للإدراج قبل إغلاق الجسم",

    "Gamification": "التلعيب",
    "Points, badges, and rewards system": "نظام النقاط والشارات والمكافآت",
    "Enable gamification features (points, badges, levels)": "تمكين ميزات التلعيب (النقاط والشارات والمستويات)",
    "Points Per Task": "النقاط لكل مهمة",
    "Points awarded for completing a task": "النقاط الممنوحة لإكمال مهمة",
    "Points Per Challenge": "النقاط لكل تحدي",
    "Bonus points for completing an entire challenge": "نقاط إضافية لإكمال تحدي كامل",
    "Points Per Idea": "النقاط لكل فكرة",
    "Points for having an idea approved": "النقاط للحصول على موافقة على فكرة",
    "Points Per Vote": "النقاط لكل تصويت",
    "Points for receiving a vote on idea/comment": "النقاط لتلقي تصويت على فكرة/تعليق",
    "Badges": "الشارات",
    "Enable achievement badges for users": "تمكين شارات الإنجاز للمستخدمين",
    "User Levels": "مستويات المستخدم",
    "Enable leveling system based on points": "تمكين نظام المستويات بناءً على النقاط",
    "Activity Streaks": "سلاسل النشاط",
    "Track daily activity streaks": "تتبع سلاسل النشاط اليومية",

    "Localization": "التوطين",
    "Language and regional settings": "إعدادات اللغة والمنطقة",
    "Default Language": "اللغة الافتراضية",
    "Default platform language": "لغة المنصة الافتراضية",
    "Available Languages": "اللغات المتاحة",
    "Comma-separated list of available languages": "قائمة باللغات المتاحة مفصولة بفواصل",
    "Default Timezone": "المنطقة الزمنية الافتراضية",
    "Default timezone for the platform": "المنطقة الزمنية الافتراضية للمنصة",
    "Date Format": "تنسيق التاريخ",
    "Default date display format": "تنسيق عرض التاريخ الافتراضي",
    "Time Format": "تنسيق الوقت",
    "Default time display format": "تنسيق عرض الوقت الافتراضي",
    "RTL Support": "دعم RTL",
    "Enable right-to-left layout for Arabic": "تمكين التخطيط من اليمين إلى اليسار للغة العربية",

    "Performance": "الأداء",
    "Caching and optimization settings": "إعدادات التخزين المؤقت والتحسين",
    "Page Caching": "تخزين الصفحات مؤقتاً",
    "Enable page-level caching for performance": "تمكين التخزين المؤقت على مستوى الصفحة للأداء",
    "Cache TTL (Minutes)": "مدة التخزين المؤقت (بالدقائق)",
    "How long to cache pages in minutes": "مدة تخزين الصفحات مؤقتاً بالدقائق",
    "Image Optimization": "تحسين الصور",
    "Automatically optimize uploaded images": "تحسين الصور المرفوعة تلقائياً",
    "Lazy Loading": "التحميل الكسول",
    "Enable lazy loading for images": "تمكين التحميل الكسول للصور",
    "Minify Assets": "تصغير الأصول",
    "Minify CSS and JavaScript files": "تصغير ملفات CSS وJavaScript",
    "CDN": "شبكة توزيع المحتوى",
    "Use CDN for static assets": "استخدام CDN للأصول الثابتة",
    "CDN URL": "رابط CDN",
    "CDN base URL for assets": "رابط CDN الأساسي للأصول",

    "Legal & Compliance": "القانون والامتثال",
    "GDPR, cookies, and legal requirements": "GDPR والكوكيز والمتطلبات القانونية",
    "GDPR Compliance": "الامتثال لـ GDPR",
    "Enable GDPR compliance features": "تمكين ميزات الامتثال لـ GDPR",
    "Cookie Consent": "موافقة الكوكيز",
    "Show cookie consent banner": "عرض شعار موافقة الكوكيز",
    "Cookie Consent Text": "نص موافقة الكوكيز",
    "Text shown in cookie consent banner": "النص المعروض في شعار موافقة الكوكيز",
    "Terms Last Updated": "آخر تحديث للشروط",
    "Date when terms were last updated": "تاريخ آخر تحديث للشروط",
    "Privacy Last Updated": "آخر تحديث للخصوصية",
    "Date when privacy policy was last updated": "تاريخ آخر تحديث لسياسة الخصوصية",
    "Data Retention (Days)": "الاحتفاظ بالبيانات (بالأيام)",
    "How long to retain user data after deletion": "مدة الاحتفاظ ببيانات المستخدم بعد الحذف",

    "Developer": "المطور",
    "Advanced developer settings": "إعدادات المطور المتقدمة",
    "Debug Mode": "وضع التصحيح",
    "Enable debug mode (not recommended for production)": "تمكين وضع التصحيح (غير موصى به للإنتاج)",
    "Log Level": "مستوى السجل",
    "Minimum log level to record": "الحد الأدنى لمستوى السجل للتسجيل",
    "API Debug Mode": "وضع تصحيح API",
    "Include debug information in API responses": "تضمين معلومات التصحيح في استجابات API",
    "Webhook URL": "رابط Webhook",
    "URL to send webhook notifications": "رابط لإرسال إشعارات Webhook",
    "Webhook Secret": "سر Webhook",
    "Secret key for webhook signature verification": "مفتاح سري للتحقق من توقيع Webhook",
    "Custom CSS": "CSS مخصص",
    "Custom CSS styles to apply globally": "أنماط CSS مخصصة للتطبيق عالمياً",
    "Custom JavaScript": "JavaScript مخصص",
    "Custom JavaScript to execute globally": "JavaScript مخصص للتنفيذ عالمياً",

    "Onboarding": "التأهيل",
    "New user onboarding experience": "تجربة تأهيل المستخدم الجديد",
    "User Onboarding": "تأهيل المستخدم",
    "Show onboarding tour for new users": "عرض جولة التأهيل للمستخدمين الجدد",
    "Welcome Email": "رسالة الترحيب",
    "Send welcome email to new users": "إرسال رسالة ترحيب للمستخدمين الجدد",
    "Welcome Message": "رسالة الترحيب",
    "Welcome message shown to new users": "رسالة الترحيب المعروضة للمستخدمين الجدد",
    "Getting Started Video": "فيديو البدء",
    "URL to getting started video (YouTube/Vimeo)": "رابط فيديو البدء (يوتيوب/فيميو)",
    "Contextual Tips": "نصائح سياقية",
    "Show helpful tips throughout the platform": "عرض نصائح مفيدة في جميع أنحاء المنصة",

    "Teams Feature": "ميزة الفرق",
    "Enable team creation and management": "تمكين إنشاء وإدارة الفرق",
    "Ideas Feature": "ميزة الأفكار",
    "Enable idea submission for challenges": "تمكين تقديم الأفكار للتحديات",
    "NDA Feature": "ميزة اتفاقية عدم الإفشاء",
    "Enable NDA signing requirements": "تمكين متطلبات توقيع اتفاقية عدم الإفشاء",
    "CV Upload": "رفع السيرة الذاتية",
    "Allow volunteers to upload CVs": "السماح للمتطوعين برفع السير الذاتية",
    "Analytics Dashboard": "لوحة التحليلات",
    "Show analytics dashboard to companies": "عرض لوحة التحليلات للشركات",
    "Dark Mode": "الوضع الداكن",
    "Enable dark mode option for users": "تمكين خيار الوضع الداكن للمستخدمين",
    "Data Export": "تصدير البيانات",
    "Allow users to export their data": "السماح للمستخدمين بتصدير بياناتهم",

    "Expand": "توسيع",
    "Collapse": "طي",
    "Saving...": "جارٍ الحفظ...",
    "Enter text...": "أدخل النص...",
    "Enter value...": "أدخل القيمة...",
    "Public": "عام",
    "Daily": "يومي",
    "Weekly": "أسبوعي",
    "Monthly": "شهري",

    "Challenges Management": "إدارة التحديات",
    "View, manage and analyze all platform challenges": "عرض وإدارة وتحليل جميع تحديات المنصة",
    "Analytics": "التحليلات",
    "Export": "تصدير",
    "All Statuses": "جميع الحالات",
    "All Types": "جميع الأنواع",
    "All Priorities": "جميع الأولويات",
    "All Companies": "جميع الشركات",
    "Advanced Filters": "فلاتر متقدمة",
    "All Sources": "جميع المصادر",
    "Featured Only": "المميزة فقط",
    "Not Featured": "غير مميزة",
    "Date From": "من تاريخ",
    "Date To": "إلى تاريخ",
    "Date Created": "تاريخ الإنشاء",
    "Last Updated": "آخر تحديث",
    "Views": "المشاهدات",
    "Newest": "الأحدث",
    "Oldest": "الأقدم",
    "Clear": "مسح",
    "selected": "محدد",
    "Clear selection": "مسح التحديد",
    "Activate": "تفعيل",
    "Archive": "أرشفة",
    "Feature": "تمييز",
    "Pinned": "مثبت",
    "URGENT": "عاجل",
    "HIGH": "عالي",
    "Tasks": "المهام",
    "views": "مشاهدات",
    "View": "عرض",
    "Edit": "تعديل",
    "Progress": "التقدم",
    "No challenges found": "لم يتم العثور على تحديات",
    "Try adjusting your filters or check back later.": "حاول تعديل الفلاتر أو تحقق لاحقاً.",
    "Please select at least one challenge": "الرجاء تحديد تحدي واحد على الأقل",
    "Are you sure you want to delete the selected challenges? This action cannot be undone.": "هل أنت متأكد من حذف التحديات المحددة؟ لا يمكن التراجع عن هذا الإجراء.",
    "Operation failed": "فشلت العملية",
    "An error occurred": "حدث خطأ",
    "Challenge Details": "تفاصيل التحدي",
    "Challenge ID": "معرف التحدي",
    "Created": "تم الإنشاء",
    "Featured": "مميز",
    "Re-analyze": "إعادة التحليل",
    "Processing...": "جارٍ المعالجة...",
    "Are you sure you want to delete this challenge? This action cannot be undone.": "هل أنت متأكد من حذف هذا التحدي؟ لا يمكن التراجع عن هذا الإجراء.",
    "Quick Actions": "إجراءات سريعة",
    "Challenge Description": "وصف التحدي",
    "AI Refined Brief": "الملخص المحسن بالذكاء الاصطناعي",
    "AI Analysis": "تحليل الذكاء الاصطناعي",
    "Confidence": "الثقة",
    "Summary": "الملخص",
    "Objectives": "الأهداف",
    "Workstreams & Tasks": "مسارات العمل والمهام",
    "Workstreams": "مسارات العمل",
    "tasks": "مهام",
    "Assigned": "معين",
    "Admin Activity Log": "سجل نشاط المدير",
    "Submitter": "مقدم الطلب",
    "Details": "التفاصيل",
    "Type": "النوع",
    "Field": "المجال",
    "Complexity": "التعقيد",
    "Deadline": "الموعد النهائي",
    "Status History": "سجل الحالة",
    "Add Note": "إضافة ملاحظة",
    "Add a note about this challenge...": "أضف ملاحظة حول هذا التحدي...",
    "Admin Note": "ملاحظة المدير",
    "Internal Note": "ملاحظة داخلية",
    "Admin Notes": "ملاحظات المدير",
    "Please provide a reason for rejection:": "الرجاء تقديم سبب الرفض:",
    "AI analysis has been queued. The challenge will be reanalyzed shortly.": "تم وضع تحليل الذكاء الاصطناعي في قائمة الانتظار. سيتم إعادة تحليل التحدي قريباً.",
    "Note added successfully": "تمت إضافة الملاحظة بنجاح",
    "Challenge featured successfully": "تم تمييز التحدي بنجاح",
    "Challenge unfeatured": "تم إلغاء تمييز التحدي",
    "Challenge pinned successfully": "تم تثبيت التحدي بنجاح",
    "Challenge unpinned": "تم إلغاء تثبيت التحدي",
    "Challenge status updated successfully": "تم تحديث حالة التحدي بنجاح",
    "Edit Challenge": "تعديل التحدي",
    "Modify challenge details and settings": "تعديل تفاصيل وإعدادات التحدي",
    "Basic Information": "المعلومات الأساسية",
    "Original Description": "الوصف الأصلي",
    "Auto-generated by AI. You can manually edit if needed.": "تم إنشاؤه تلقائياً بواسطة الذكاء الاصطناعي. يمكنك التعديل يدوياً إذا لزم الأمر.",
    "Field/Domain": "المجال/النطاق",
    "e.g., Technology, Marketing, Design": "مثال: التقنية، التسويق، التصميم",
    "Status & Classification": "الحالة والتصنيف",
    "Challenge Type": "نوع التحدي",
    "Not Set": "غير محدد",
    "Status Change Reason": "سبب تغيير الحالة",
    "Optional: Explain why the status is being changed": "اختياري: اشرح سبب تغيير الحالة",
    "Scoring & Complexity": "التقييم والتعقيد",
    "Feature Flags": "علامات الميزات",
    "Featured Challenge": "تحدي مميز",
    "Display this challenge prominently": "عرض هذا التحدي بشكل بارز",
    "Pin this challenge to the top": "تثبيت هذا التحدي في الأعلى",
    "Budget Information": "معلومات الميزانية",
    "Estimated Budget": "الميزانية المقدرة",
    "Actual Budget": "الميزانية الفعلية",
    "Currency": "العملة",
    "Tags & Notes": "الوسوم والملاحظات",
    "Tags": "الوسوم",
    "Comma-separated tags": "وسوم مفصولة بفواصل",
    "External Reference": "المرجع الخارجي",
    "External ID or reference number": "المعرف الخارجي أو رقم المرجع",
    "Internal notes are only visible to admins.": "الملاحظات الداخلية مرئية فقط للمديرين.",
    "Cancel": "إلغاء",
    "Save Changes": "حفظ التغييرات",
    "Challenge updated successfully": "تم تحديث التحدي بنجاح",
    "Challenge deleted successfully": "تم حذف التحدي بنجاح",
    "Challenges Analytics": "تحليلات التحديات",
    "Insights and trends for platform challenges": "رؤى واتجاهات تحديات المنصة",
    "Last 7 Days": "آخر 7 أيام",
    "Last 30 Days": "آخر 30 يوم",
    "Last 90 Days": "آخر 90 يوم",
    "Last Year": "السنة الماضية",
    "Back": "رجوع",
    "Avg Analysis Time": "متوسط وقت التحليل",
    "Avg Completion": "متوسط الإنجاز",
    "days": "أيام",
    "Volunteer Engagement": "تفاعل المتطوعين",
    "Success Rate": "نسبة النجاح",
    "Challenges Over Time": "التحديات عبر الزمن",
    "Status Distribution": "توزيع الحالة",
    "Challenge Types": "أنواع التحديات",
    "Top Companies": "أفضل الشركات",
    "No data available": "لا تتوفر بيانات",
    "Completion Trends": "اتجاهات الإنجاز",
    "Average Scores by Field": "متوسط الدرجات حسب المجال",
    "challenges": "تحديات",
    "Challenges": "التحديات",
    "Total": "الإجمالي",
    "Pending": "قيد الانتظار",
    "Active": "نشط",
    "Completed": "مكتمل",
    "This Month": "هذا الشهر",
    "Growth": "النمو",
    "Community Discussion": "نقاش مجتمعي",
    "Team Execution": "تنفيذ الفريق",
    "Submitted": "مقدم",
    "Analyzing": "قيد التحليل",
    "In Progress": "قيد التنفيذ",
    "Delivered": "تم التسليم",
    "Archived": "مؤرشف",
    "Rejected": "مرفوض",
    "Low": "منخفض",
    "Normal": "عادي",
    "High": "عالي",
    "Urgent": "عاجل",
    "Priority": "الأولوية",
    "Visibility": "الرؤية",
    "Private": "خاص",
    "Unlisted": "غير مدرج",
    "Contributor": "مساهم",
    "Community": "المجتمع",
    "Community Submission": "تقديم مجتمعي",
    ":count challenges updated successfully": "تم تحديث :count تحديات بنجاح",
    "Priority updated successfully": "تم تحديث الأولوية بنجاح",
    "Delete Challenge": "حذف التحدي",
    "Delete & Notify Owner": "حذف وإخطار المالك",
    "Reason for deletion": "سبب الحذف",
    "Please explain why this challenge is being deleted. This message will be sent to the owner.": "يرجى توضيح سبب حذف هذا التحدي. سيتم إرسال هذه الرسالة إلى المالك.",
    "The owner will be notified via notification with this reason.": "سيتم إخطار المالك عبر إشعار مع هذا السبب.",
    "This action cannot be undone.": "لا يمكن التراجع عن هذا الإجراء.",
    "Challenge deleted successfully. The owner has been notified.": "تم حذف التحدي بنجاح. تم إخطار المالك.",
    "Challenge Deleted": "تم حذف التحدي",
    "Your challenge \":title\" has been removed by the platform administrator.": "تم حذف تحديك \":title\" من قبل مسؤول المنصة.",
    "Enter reason for deletion (required)...": "أدخل سبب الحذف (مطلوب)...",
    "Delete Selected": "حذف المحدد",
    "The owners will be notified with the reason for deletion.": "سيتم إخطار المالكين بسبب الحذف.",
    "Please select at least one challenge": "يرجى تحديد تحدي واحد على الأقل",
    "Please provide a deletion reason (at least 10 characters)": "يرجى تقديم سبب الحذف (10 أحرف على الأقل)",
    "Are you sure you want to delete the selected challenges? This action cannot be undone. The owners will be notified.": "هل أنت متأكد من حذف التحديات المحددة؟ لا يمكن التراجع عن هذا الإجراء. سيتم إخطار المالكين.",
    ":count challenges deleted successfully. Owners have been notified.": "تم حذف :count تحديات بنجاح. تم إخطار المالكين.",
    "View and manage platform challenges": "عرض وإدارة تحديات المنصة",
    "Clear selection": "إلغاء التحديد",
    "selected": "محدد",
    "Progress Overview": "نظرة عامة على التقدم",
    "Overall Completion": "الإكمال الكلي",
    "Total Hours": "إجمالي الساعات",
    "Remaining Hours": "الساعات المتبقية",
    "Time Progress": "تقدم الوقت",
    "Performance": "الأداء",
    "Task Status Breakdown": "تفصيل حالة المهام",
    "Pending": "معلق",
    "In Progress": "قيد التنفيذ",
    "Completed": "مكتمل",
    "AI Analysis Details": "تفاصيل تحليل الذكاء الاصطناعي",
    "Comprehensive AI-powered challenge analysis": "تحليل شامل للتحدي مدعوم بالذكاء الاصطناعي",
    "Stage": "المرحلة",
    "Requires Review": "يتطلب مراجعة",
    "Confidence": "الثقة",
    "Est. Effort": "الجهد المقدر",
    "Objectives": "الأهداف",
    "Success Criteria": "معايير النجاح",
    "Constraints": "القيود",
    "Assumptions": "الافتراضات",
    "Stakeholders": "أصحاب المصلحة",
    "Missing Information": "المعلومات المفقودة",
    "Complexity Justification": "مبررات التعقيد",
    "Risk Assessment": "تقييم المخاطر",
    "Recommended Approach": "النهج الموصى به",
    "Validation Errors": "أخطاء التحقق",
    "Model": "النموذج",
    "Tokens Used": "الرموز المستخدمة",
    "Analyzed": "تم التحليل",
    "No AI Analysis Yet": "لا يوجد تحليل ذكاء اصطناعي بعد",
    "AI analysis has not been performed on this challenge yet.": "لم يتم إجراء تحليل الذكاء الاصطناعي على هذا التحدي بعد.",
    "tasks completed": "مهام مكتملة",
    "Assigned to": "مخصص لـ",
    "On Track": "على المسار",
    "At Risk": "معرض للخطر",
    "Behind": "متأخر",
    "Health": "الحالة",
    "out of 10": "من 10",
    "Level": "المستوى",
    "AI Status": "حالة الذكاء الاصطناعي",
    "Analyzed At": "تم التحليل في",
    "Teams": "الفرق",
    "members": "أعضاء",
    "Deadline Passed": "انتهى الموعد النهائي",
    "Deadline Approaching": "الموعد النهائي يقترب",
    "Challenge Deadline": "الموعد النهائي للتحدي",
    "days overdue": "أيام متأخرة",
    "Days": "أيام",
    "Mins": "دقائق",
    "Risks & Constraints": "المخاطر والقيود",
    "No stakeholders identified": "لم يتم تحديد أصحاب المصلحة",
    "No recommended approach available": "لا يوجد نهج موصى به متاح",
    "Review Required": "مراجعة مطلوبة",
    "Community": "المجتمع",
    "Complexity Level": "مستوى التعقيد",
    "Est. Effort": "الجهد المقدر",
    "Validation": "التحقق",
    "Model": "النموذج",
    "Tokens": "الرموز",
    "Analyzed": "تم التحليل"
}